zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXN/periph/PERI_SYSCON.h
#define SYSCON_PRESETCTRL1_FC0_RST_MASK          (0x800U)
#define SYSCON_PRESETCTRL1_FC0_RST_SHIFT         (11U)
/*! FC0_RST - LP_FLEXCOMM0 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL1_FC0_RST(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL1_FC0_RST_SHIFT)) & SYSCON_PRESETCTRL1_FC0_RST_MASK)

#define SYSCON_PRESETCTRL1_FC1_RST_MASK          (0x1000U)
#define SYSCON_PRESETCTRL1_FC1_RST_SHIFT         (12U)
/*! FC1_RST - LP_FLEXCOMM1 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL1_FC1_RST(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL1_FC1_RST_SHIFT)) & SYSCON_PRESETCTRL1_FC1_RST_MASK)

#define SYSCON_PRESETCTRL1_FC2_RST_MASK          (0x2000U)
#define SYSCON_PRESETCTRL1_FC2_RST_SHIFT         (13U)
/*! FC2_RST - LP_FLEXCOMM2 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL1_FC2_RST(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL1_FC2_RST_SHIFT)) & SYSCON_PRESETCTRL1_FC2_RST_MASK)

#define SYSCON_PRESETCTRL1_FC3_RST_MASK          (0x4000U)
#define SYSCON_PRESETCTRL1_FC3_RST_SHIFT         (14U)
/*! FC3_RST - LP_FLEXCOMM3 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL1_FC3_RST(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL1_FC3_RST_SHIFT)) & SYSCON_PRESETCTRL1_FC3_RST_MASK)

#define SYSCON_PRESETCTRL1_FC4_RST_MASK          (0x8000U)
#define SYSCON_PRESETCTRL1_FC4_RST_SHIFT         (15U)
/*! FC4_RST - LP_FLEXCOMM4 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL1_FC4_RST(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL1_FC4_RST_SHIFT)) & SYSCON_PRESETCTRL1_FC4_RST_MASK)

#define SYSCON_PRESETCTRL1_FC5_RST_MASK          (0x10000U)
#define SYSCON_PRESETCTRL1_FC5_RST_SHIFT         (16U)
/*! FC5_RST - LP_FLEXCOMM5 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL1_FC5_RST(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL1_FC5_RST_SHIFT)) & SYSCON_PRESETCTRL1_FC5_RST_MASK)

#define SYSCON_PRESETCTRL1_FC6_RST_MASK          (0x20000U)
#define SYSCON_PRESETCTRL1_FC6_RST_SHIFT         (17U)
/*! FC6_RST - LP_FLEXCOMM6 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL1_FC6_RST(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL1_FC6_RST_SHIFT)) & SYSCON_PRESETCTRL1_FC6_RST_MASK)

#define SYSCON_PRESETCTRL1_FC7_RST_MASK          (0x40000U)
#define SYSCON_PRESETCTRL1_FC7_RST_SHIFT         (18U)
/*! FC7_RST - LP_FLEXCOMM7 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL1_FC7_RST(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL1_FC7_RST_SHIFT)) & SYSCON_PRESETCTRL1_FC7_RST_MASK)

#define SYSCON_PRESETCTRL1_FC8_RST_MASK          (0x80000U)
#define SYSCON_PRESETCTRL1_FC8_RST_SHIFT         (19U)
/*! FC8_RST - LP_FLEXCOMM8 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL1_FC8_RST(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL1_FC8_RST_SHIFT)) & SYSCON_PRESETCTRL1_FC8_RST_MASK)

#define SYSCON_PRESETCTRL1_FC9_RST_MASK          (0x100000U)
#define SYSCON_PRESETCTRL1_FC9_RST_SHIFT         (20U)
/*! FC9_RST - LP_FLEXCOMM9 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL1_FC9_RST(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL1_FC9_RST_SHIFT)) & SYSCON_PRESETCTRL1_FC9_RST_MASK)

#define SYSCON_PRESETCTRL1_MICFIL_RST_MASK       (0x200000U)
#define SYSCON_PRESETCTRL1_MICFIL_RST_SHIFT      (21U)
/*! MICFIL_RST - MICFIL reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL1_MICFIL_RST(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL1_MICFIL_RST_SHIFT)) & SYSCON_PRESETCTRL1_MICFIL_RST_MASK)

#define SYSCON_PRESETCTRL1_TIMER2_RST_MASK       (0x400000U)
#define SYSCON_PRESETCTRL1_TIMER2_RST_SHIFT      (22U)
/*! TIMER2_RST - CTIMER2 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL1_TIMER2_RST(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL1_TIMER2_RST_SHIFT)) & SYSCON_PRESETCTRL1_TIMER2_RST_MASK)

#define SYSCON_PRESETCTRL1_USB0_FS_DCD_RST_MASK  (0x1000000U)
#define SYSCON_PRESETCTRL1_USB0_FS_DCD_RST_SHIFT (24U)
/*! USB0_FS_DCD_RST - USB FS DCD reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL1_USB0_FS_DCD_RST(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL1_USB0_FS_DCD_RST_SHIFT)) & SYSCON_PRESETCTRL1_USB0_FS_DCD_RST_MASK)

#define SYSCON_PRESETCTRL1_USB0_FS_RST_MASK      (0x2000000U)
#define SYSCON_PRESETCTRL1_USB0_FS_RST_SHIFT     (25U)
/*! USB0_FS_RST - USB FS reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL1_USB0_FS_RST(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL1_USB0_FS_RST_SHIFT)) & SYSCON_PRESETCTRL1_USB0_FS_RST_MASK)

#define SYSCON_PRESETCTRL1_TIMER0_RST_MASK       (0x4000000U)
#define SYSCON_PRESETCTRL1_TIMER0_RST_SHIFT      (26U)
/*! TIMER0_RST - CTIMER0 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL1_TIMER0_RST(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL1_TIMER0_RST_SHIFT)) & SYSCON_PRESETCTRL1_TIMER0_RST_MASK)

#define SYSCON_PRESETCTRL1_TIMER1_RST_MASK       (0x8000000U)
#define SYSCON_PRESETCTRL1_TIMER1_RST_SHIFT      (27U)
/*! TIMER1_RST - CTIMER1 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL1_TIMER1_RST(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL1_TIMER1_RST_SHIFT)) & SYSCON_PRESETCTRL1_TIMER1_RST_MASK)

#define SYSCON_PRESETCTRL1_SmartDMA_RST_MASK     (0x80000000U)
#define SYSCON_PRESETCTRL1_SmartDMA_RST_SHIFT    (31U)
/*! SmartDMA_RST - SmartDMA reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL1_SmartDMA_RST(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL1_SmartDMA_RST_SHIFT)) & SYSCON_PRESETCTRL1_SmartDMA_RST_MASK)
/*! @} */

/*! @name PRESETCTRL2 - Peripheral Reset Control 2 */
/*! @{ */

#define SYSCON_PRESETCTRL2_DMA1_RST_MASK         (0x2U)
#define SYSCON_PRESETCTRL2_DMA1_RST_SHIFT        (1U)
/*! DMA1_RST - DMA1 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL2_DMA1_RST(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL2_DMA1_RST_SHIFT)) & SYSCON_PRESETCTRL2_DMA1_RST_MASK)

#define SYSCON_PRESETCTRL2_ENET_RST_MASK         (0x4U)
#define SYSCON_PRESETCTRL2_ENET_RST_SHIFT        (2U)
/*! ENET_RST - Ethernet reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL2_ENET_RST(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL2_ENET_RST_SHIFT)) & SYSCON_PRESETCTRL2_ENET_RST_MASK)

#define SYSCON_PRESETCTRL2_USDHC_RST_MASK        (0x8U)
#define SYSCON_PRESETCTRL2_USDHC_RST_SHIFT       (3U)
/*! USDHC_RST - uSDHC reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL2_USDHC_RST(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL2_USDHC_RST_SHIFT)) & SYSCON_PRESETCTRL2_USDHC_RST_MASK)

#define SYSCON_PRESETCTRL2_FLEXIO_RST_MASK       (0x10U)
#define SYSCON_PRESETCTRL2_FLEXIO_RST_SHIFT      (4U)
/*! FLEXIO_RST - FLEXIO reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL2_FLEXIO_RST(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL2_FLEXIO_RST_SHIFT)) & SYSCON_PRESETCTRL2_FLEXIO_RST_MASK)

#define SYSCON_PRESETCTRL2_SAI0_RST_MASK         (0x20U)
#define SYSCON_PRESETCTRL2_SAI0_RST_SHIFT        (5U)
/*! SAI0_RST - SAI0 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL2_SAI0_RST(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL2_SAI0_RST_SHIFT)) & SYSCON_PRESETCTRL2_SAI0_RST_MASK)

#define SYSCON_PRESETCTRL2_SAI1_RST_MASK         (0x40U)
#define SYSCON_PRESETCTRL2_SAI1_RST_SHIFT        (6U)
/*! SAI1_RST - SAI1 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL2_SAI1_RST(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL2_SAI1_RST_SHIFT)) & SYSCON_PRESETCTRL2_SAI1_RST_MASK)

#define SYSCON_PRESETCTRL2_TRO_RST_MASK          (0x80U)
#define SYSCON_PRESETCTRL2_TRO_RST_SHIFT         (7U)
/*! TRO_RST - TRO reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL2_TRO_RST(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL2_TRO_RST_SHIFT)) & SYSCON_PRESETCTRL2_TRO_RST_MASK)

#define SYSCON_PRESETCTRL2_FREQME_RST_MASK       (0x100U)
#define SYSCON_PRESETCTRL2_FREQME_RST_SHIFT      (8U)
/*! FREQME_RST - FREQME reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL2_FREQME_RST(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL2_FREQME_RST_SHIFT)) & SYSCON_PRESETCTRL2_FREQME_RST_MASK)

