zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXN/periph/PERI_SYSCON.h
#define SYSCON_PRESETCTRL2_TRNG_RST_MASK         (0x2000U)
#define SYSCON_PRESETCTRL2_TRNG_RST_SHIFT        (13U)
/*! TRNG_RST - TRNG reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL2_TRNG_RST(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL2_TRNG_RST_SHIFT)) & SYSCON_PRESETCTRL2_TRNG_RST_MASK)

#define SYSCON_PRESETCTRL2_FLEXCAN0_RST_MASK     (0x4000U)
#define SYSCON_PRESETCTRL2_FLEXCAN0_RST_SHIFT    (14U)
/*! FLEXCAN0_RST - CAN0 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL2_FLEXCAN0_RST(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL2_FLEXCAN0_RST_SHIFT)) & SYSCON_PRESETCTRL2_FLEXCAN0_RST_MASK)

#define SYSCON_PRESETCTRL2_FLEXCAN1_RST_MASK     (0x8000U)
#define SYSCON_PRESETCTRL2_FLEXCAN1_RST_SHIFT    (15U)
/*! FLEXCAN1_RST - CAN1 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL2_FLEXCAN1_RST(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL2_FLEXCAN1_RST_SHIFT)) & SYSCON_PRESETCTRL2_FLEXCAN1_RST_MASK)

#define SYSCON_PRESETCTRL2_USB_HS_RST_MASK       (0x10000U)
#define SYSCON_PRESETCTRL2_USB_HS_RST_SHIFT      (16U)
/*! USB_HS_RST - USB HS reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL2_USB_HS_RST(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL2_USB_HS_RST_SHIFT)) & SYSCON_PRESETCTRL2_USB_HS_RST_MASK)

#define SYSCON_PRESETCTRL2_USB_HS_PHY_RST_MASK   (0x20000U)
#define SYSCON_PRESETCTRL2_USB_HS_PHY_RST_SHIFT  (17U)
/*! USB_HS_PHY_RST - USB HS PHY reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL2_USB_HS_PHY_RST(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL2_USB_HS_PHY_RST_SHIFT)) & SYSCON_PRESETCTRL2_USB_HS_PHY_RST_MASK)

#define SYSCON_PRESETCTRL2_PQ_RST_MASK           (0x80000U)
#define SYSCON_PRESETCTRL2_PQ_RST_SHIFT          (19U)
/*! PQ_RST - PowerQuad reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL2_PQ_RST(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL2_PQ_RST_SHIFT)) & SYSCON_PRESETCTRL2_PQ_RST_MASK)

#define SYSCON_PRESETCTRL2_PLU_RST_MASK          (0x100000U)
#define SYSCON_PRESETCTRL2_PLU_RST_SHIFT         (20U)
/*! PLU_RST - PLU reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL2_PLU_RST(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL2_PLU_RST_SHIFT)) & SYSCON_PRESETCTRL2_PLU_RST_MASK)

#define SYSCON_PRESETCTRL2_TIMER3_RST_MASK       (0x200000U)
#define SYSCON_PRESETCTRL2_TIMER3_RST_SHIFT      (21U)
/*! TIMER3_RST - CTIMER3 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL2_TIMER3_RST(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL2_TIMER3_RST_SHIFT)) & SYSCON_PRESETCTRL2_TIMER3_RST_MASK)

#define SYSCON_PRESETCTRL2_TIMER4_RST_MASK       (0x400000U)
#define SYSCON_PRESETCTRL2_TIMER4_RST_SHIFT      (22U)
/*! TIMER4_RST - CTIMER4 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL2_TIMER4_RST(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL2_TIMER4_RST_SHIFT)) & SYSCON_PRESETCTRL2_TIMER4_RST_MASK)

#define SYSCON_PRESETCTRL2_PUF_RST_MASK          (0x800000U)
#define SYSCON_PRESETCTRL2_PUF_RST_SHIFT         (23U)
/*! PUF_RST - PUF reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL2_PUF_RST(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL2_PUF_RST_SHIFT)) & SYSCON_PRESETCTRL2_PUF_RST_MASK)

#define SYSCON_PRESETCTRL2_PKC_RST_MASK          (0x1000000U)
#define SYSCON_PRESETCTRL2_PKC_RST_SHIFT         (24U)
/*! PKC_RST - PKC reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL2_PKC_RST(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL2_PKC_RST_SHIFT)) & SYSCON_PRESETCTRL2_PKC_RST_MASK)

#define SYSCON_PRESETCTRL2_SM3_RST_MASK          (0x40000000U)
#define SYSCON_PRESETCTRL2_SM3_RST_SHIFT         (30U)
/*! SM3_RST - SM3 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL2_SM3_RST(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL2_SM3_RST_SHIFT)) & SYSCON_PRESETCTRL2_SM3_RST_MASK)
/*! @} */

/*! @name PRESETCTRL3 - Peripheral Reset Control 3 */
/*! @{ */

#define SYSCON_PRESETCTRL3_I3C0_RST_MASK         (0x1U)
#define SYSCON_PRESETCTRL3_I3C0_RST_SHIFT        (0U)
/*! I3C0_RST - I3C0 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL3_I3C0_RST(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL3_I3C0_RST_SHIFT)) & SYSCON_PRESETCTRL3_I3C0_RST_MASK)

#define SYSCON_PRESETCTRL3_I3C1_RST_MASK         (0x2U)
#define SYSCON_PRESETCTRL3_I3C1_RST_SHIFT        (1U)
/*! I3C1_RST - I3C1 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL3_I3C1_RST(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL3_I3C1_RST_SHIFT)) & SYSCON_PRESETCTRL3_I3C1_RST_MASK)

#define SYSCON_PRESETCTRL3_SINC_RST_MASK         (0x4U)
#define SYSCON_PRESETCTRL3_SINC_RST_SHIFT        (2U)
/*! SINC_RST - SINC reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL3_SINC_RST(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL3_SINC_RST_SHIFT)) & SYSCON_PRESETCTRL3_SINC_RST_MASK)

#define SYSCON_PRESETCTRL3_COOLFLUX_RST_MASK     (0x8U)
#define SYSCON_PRESETCTRL3_COOLFLUX_RST_SHIFT    (3U)
/*! COOLFLUX_RST - CoolFlux reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL3_COOLFLUX_RST(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL3_COOLFLUX_RST_SHIFT)) & SYSCON_PRESETCTRL3_COOLFLUX_RST_MASK)

#define SYSCON_PRESETCTRL3_QDC0_RST_MASK         (0x10U)
#define SYSCON_PRESETCTRL3_QDC0_RST_SHIFT        (4U)
/*! QDC0_RST - QDC0 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL3_QDC0_RST(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL3_QDC0_RST_SHIFT)) & SYSCON_PRESETCTRL3_QDC0_RST_MASK)

#define SYSCON_PRESETCTRL3_QDC1_RST_MASK         (0x20U)
#define SYSCON_PRESETCTRL3_QDC1_RST_SHIFT        (5U)
/*! QDC1_RST - QDC1 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL3_QDC1_RST(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL3_QDC1_RST_SHIFT)) & SYSCON_PRESETCTRL3_QDC1_RST_MASK)

#define SYSCON_PRESETCTRL3_PWM0_RST_MASK         (0x40U)
#define SYSCON_PRESETCTRL3_PWM0_RST_SHIFT        (6U)
/*! PWM0_RST - PWM0 reset control
 *  0b0..Block is not reset
 *  0b1..Block is reset
 */
#define SYSCON_PRESETCTRL3_PWM0_RST(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_PRESETCTRL3_PWM0_RST_SHIFT)) & SYSCON_PRESETCTRL3_PWM0_RST_MASK)

