zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXN/periph/PERI_SYSCON.h
#define SYSCON_AHBCLKCTRL0_RAME_CTRL_MASK        (0x20U)
#define SYSCON_AHBCLKCTRL0_RAME_CTRL_SHIFT       (5U)
/*! RAME_CTRL - Enables the clock for the RAME Controller
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_RAME_CTRL(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_RAME_CTRL_SHIFT)) & SYSCON_AHBCLKCTRL0_RAME_CTRL_MASK)

#define SYSCON_AHBCLKCTRL0_RAMF_CTRL_MASK        (0x40U)
#define SYSCON_AHBCLKCTRL0_RAMF_CTRL_SHIFT       (6U)
/*! RAMF_CTRL - Enables the clock for the RAMF Controller
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_RAMF_CTRL(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_RAMF_CTRL_SHIFT)) & SYSCON_AHBCLKCTRL0_RAMF_CTRL_MASK)

#define SYSCON_AHBCLKCTRL0_RAMG_CTRL_MASK        (0x80U)
#define SYSCON_AHBCLKCTRL0_RAMG_CTRL_SHIFT       (7U)
/*! RAMG_CTRL - Enables the clock for the RAMG Controller
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_RAMG_CTRL(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_RAMG_CTRL_SHIFT)) & SYSCON_AHBCLKCTRL0_RAMG_CTRL_MASK)

#define SYSCON_AHBCLKCTRL0_RAMH_CTRL_MASK        (0x100U)
#define SYSCON_AHBCLKCTRL0_RAMH_CTRL_SHIFT       (8U)
/*! RAMH_CTRL - Enables the clock for the RAMH Controller
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_RAMH_CTRL(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_RAMH_CTRL_SHIFT)) & SYSCON_AHBCLKCTRL0_RAMH_CTRL_MASK)

#define SYSCON_AHBCLKCTRL0_FMU_MASK              (0x200U)
#define SYSCON_AHBCLKCTRL0_FMU_SHIFT             (9U)
/*! FMU - Enables the clock for the Flash Management Unit
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_FMU(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_FMU_SHIFT)) & SYSCON_AHBCLKCTRL0_FMU_MASK)

#define SYSCON_AHBCLKCTRL0_FMC_MASK              (0x400U)
#define SYSCON_AHBCLKCTRL0_FMC_SHIFT             (10U)
/*! FMC - Enables the clock for the Flash Memory Controller
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_FMC(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_FMC_SHIFT)) & SYSCON_AHBCLKCTRL0_FMC_MASK)

#define SYSCON_AHBCLKCTRL0_FLEXSPI_MASK          (0x800U)
#define SYSCON_AHBCLKCTRL0_FLEXSPI_SHIFT         (11U)
/*! FLEXSPI - Enables the clock for FlexSPI
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_FLEXSPI(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_FLEXSPI_SHIFT)) & SYSCON_AHBCLKCTRL0_FLEXSPI_MASK)

#define SYSCON_AHBCLKCTRL0_MUX_MASK              (0x1000U)
#define SYSCON_AHBCLKCTRL0_MUX_SHIFT             (12U)
/*! MUX - Enables the clock for INPUTMUX
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_MUX(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_MUX_SHIFT)) & SYSCON_AHBCLKCTRL0_MUX_MASK)

#define SYSCON_AHBCLKCTRL0_PORT0_MASK            (0x2000U)
#define SYSCON_AHBCLKCTRL0_PORT0_SHIFT           (13U)
/*! PORT0 - Enables the clock for PORT0 controller
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_PORT0(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_PORT0_SHIFT)) & SYSCON_AHBCLKCTRL0_PORT0_MASK)

#define SYSCON_AHBCLKCTRL0_PORT1_MASK            (0x4000U)
#define SYSCON_AHBCLKCTRL0_PORT1_SHIFT           (14U)
/*! PORT1 - Enables the clock for PORT1
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_PORT1(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_PORT1_SHIFT)) & SYSCON_AHBCLKCTRL0_PORT1_MASK)

#define SYSCON_AHBCLKCTRL0_PORT2_MASK            (0x8000U)
#define SYSCON_AHBCLKCTRL0_PORT2_SHIFT           (15U)
/*! PORT2 - Enables the clock for PORT2
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_PORT2(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_PORT2_SHIFT)) & SYSCON_AHBCLKCTRL0_PORT2_MASK)

#define SYSCON_AHBCLKCTRL0_PORT3_MASK            (0x10000U)
#define SYSCON_AHBCLKCTRL0_PORT3_SHIFT           (16U)
/*! PORT3 - Enables the clock for PORT3
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_PORT3(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_PORT3_SHIFT)) & SYSCON_AHBCLKCTRL0_PORT3_MASK)

#define SYSCON_AHBCLKCTRL0_PORT4_MASK            (0x20000U)
#define SYSCON_AHBCLKCTRL0_PORT4_SHIFT           (17U)
/*! PORT4 - Enables the clock for PORT4
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_PORT4(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_PORT4_SHIFT)) & SYSCON_AHBCLKCTRL0_PORT4_MASK)

#define SYSCON_AHBCLKCTRL0_GPIO0_MASK            (0x80000U)
#define SYSCON_AHBCLKCTRL0_GPIO0_SHIFT           (19U)
/*! GPIO0 - Enables the clock for GPIO0
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_GPIO0(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_GPIO0_SHIFT)) & SYSCON_AHBCLKCTRL0_GPIO0_MASK)

#define SYSCON_AHBCLKCTRL0_GPIO1_MASK            (0x100000U)
#define SYSCON_AHBCLKCTRL0_GPIO1_SHIFT           (20U)
/*! GPIO1 - Enables the clock for GPIO1
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_GPIO1(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_GPIO1_SHIFT)) & SYSCON_AHBCLKCTRL0_GPIO1_MASK)

#define SYSCON_AHBCLKCTRL0_GPIO2_MASK            (0x200000U)
#define SYSCON_AHBCLKCTRL0_GPIO2_SHIFT           (21U)
/*! GPIO2 - Enables the clock for GPIO2
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_GPIO2(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_GPIO2_SHIFT)) & SYSCON_AHBCLKCTRL0_GPIO2_MASK)

#define SYSCON_AHBCLKCTRL0_GPIO3_MASK            (0x400000U)
#define SYSCON_AHBCLKCTRL0_GPIO3_SHIFT           (22U)
/*! GPIO3 - Enables the clock for GPIO3
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_GPIO3(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_GPIO3_SHIFT)) & SYSCON_AHBCLKCTRL0_GPIO3_MASK)

#define SYSCON_AHBCLKCTRL0_GPIO4_MASK            (0x800000U)
#define SYSCON_AHBCLKCTRL0_GPIO4_SHIFT           (23U)
/*! GPIO4 - Enables the clock for GPIO4
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_GPIO4(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_GPIO4_SHIFT)) & SYSCON_AHBCLKCTRL0_GPIO4_MASK)

