zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXN/periph/PERI_SYSCON.h
#define SYSCON_AHBCLKCTRL0_PINT_MASK             (0x2000000U)
#define SYSCON_AHBCLKCTRL0_PINT_SHIFT            (25U)
/*! PINT - Enables the clock for PINT
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_PINT(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_PINT_SHIFT)) & SYSCON_AHBCLKCTRL0_PINT_MASK)

#define SYSCON_AHBCLKCTRL0_DMA0_MASK             (0x4000000U)
#define SYSCON_AHBCLKCTRL0_DMA0_SHIFT            (26U)
/*! DMA0 - Enables the clock for DMA0
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_DMA0(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_DMA0_SHIFT)) & SYSCON_AHBCLKCTRL0_DMA0_MASK)

#define SYSCON_AHBCLKCTRL0_CRC_MASK              (0x8000000U)
#define SYSCON_AHBCLKCTRL0_CRC_SHIFT             (27U)
/*! CRC - Enables the clock for CRC
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_CRC(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_CRC_SHIFT)) & SYSCON_AHBCLKCTRL0_CRC_MASK)

#define SYSCON_AHBCLKCTRL0_WWDT0_MASK            (0x10000000U)
#define SYSCON_AHBCLKCTRL0_WWDT0_SHIFT           (28U)
/*! WWDT0 - Enables the clock for WWDT0
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_WWDT0(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_WWDT0_SHIFT)) & SYSCON_AHBCLKCTRL0_WWDT0_MASK)

#define SYSCON_AHBCLKCTRL0_WWDT1_MASK            (0x20000000U)
#define SYSCON_AHBCLKCTRL0_WWDT1_SHIFT           (29U)
/*! WWDT1 - Enables the clock for WWDT1
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_WWDT1(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_WWDT1_SHIFT)) & SYSCON_AHBCLKCTRL0_WWDT1_MASK)

#define SYSCON_AHBCLKCTRL0_MAILBOX_MASK          (0x80000000U)
#define SYSCON_AHBCLKCTRL0_MAILBOX_SHIFT         (31U)
/*! MAILBOX - Enables the clock for the Inter CPU communication Mailbox.
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL0_MAILBOX(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL0_MAILBOX_SHIFT)) & SYSCON_AHBCLKCTRL0_MAILBOX_MASK)
/*! @} */

/*! @name AHBCLKCTRL1 - AHB Clock Control 1 */
/*! @{ */

#define SYSCON_AHBCLKCTRL1_MRT_MASK              (0x1U)
#define SYSCON_AHBCLKCTRL1_MRT_SHIFT             (0U)
/*! MRT - Enables the clock for MRT
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_MRT(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_MRT_SHIFT)) & SYSCON_AHBCLKCTRL1_MRT_MASK)

#define SYSCON_AHBCLKCTRL1_OSTIMER_MASK          (0x2U)
#define SYSCON_AHBCLKCTRL1_OSTIMER_SHIFT         (1U)
/*! OSTIMER - Enables the clock for the OS Event Timer
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_OSTIMER(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_OSTIMER_SHIFT)) & SYSCON_AHBCLKCTRL1_OSTIMER_MASK)

#define SYSCON_AHBCLKCTRL1_SCT_MASK              (0x4U)
#define SYSCON_AHBCLKCTRL1_SCT_SHIFT             (2U)
/*! SCT - Enables the clock for SCT
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_SCT(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_SCT_SHIFT)) & SYSCON_AHBCLKCTRL1_SCT_MASK)

#define SYSCON_AHBCLKCTRL1_ADC0_MASK             (0x8U)
#define SYSCON_AHBCLKCTRL1_ADC0_SHIFT            (3U)
/*! ADC0 - Enables the clock for ADC0
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_ADC0(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_ADC0_SHIFT)) & SYSCON_AHBCLKCTRL1_ADC0_MASK)

#define SYSCON_AHBCLKCTRL1_ADC1_MASK             (0x10U)
#define SYSCON_AHBCLKCTRL1_ADC1_SHIFT            (4U)
/*! ADC1 - Enables the clock for ADC1
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_ADC1(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_ADC1_SHIFT)) & SYSCON_AHBCLKCTRL1_ADC1_MASK)

#define SYSCON_AHBCLKCTRL1_DAC0_MASK             (0x20U)
#define SYSCON_AHBCLKCTRL1_DAC0_SHIFT            (5U)
/*! DAC0 - Enables the clock for DAC0
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_DAC0(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_DAC0_SHIFT)) & SYSCON_AHBCLKCTRL1_DAC0_MASK)

#define SYSCON_AHBCLKCTRL1_RTC_MASK              (0x40U)
#define SYSCON_AHBCLKCTRL1_RTC_SHIFT             (6U)
/*! RTC - Enables the clock for RTC
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_RTC(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_RTC_SHIFT)) & SYSCON_AHBCLKCTRL1_RTC_MASK)

#define SYSCON_AHBCLKCTRL1_EVSIM0_MASK           (0x100U)
#define SYSCON_AHBCLKCTRL1_EVSIM0_SHIFT          (8U)
/*! EVSIM0 - Enables the clock for EVSIM0
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_EVSIM0(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_EVSIM0_SHIFT)) & SYSCON_AHBCLKCTRL1_EVSIM0_MASK)

#define SYSCON_AHBCLKCTRL1_EVSIM1_MASK           (0x200U)
#define SYSCON_AHBCLKCTRL1_EVSIM1_SHIFT          (9U)
/*! EVSIM1 - Enables the clock for EVSIM1
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_EVSIM1(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_EVSIM1_SHIFT)) & SYSCON_AHBCLKCTRL1_EVSIM1_MASK)

#define SYSCON_AHBCLKCTRL1_UTICK_MASK            (0x400U)
#define SYSCON_AHBCLKCTRL1_UTICK_SHIFT           (10U)
/*! UTICK - Enables the clock for UTICK
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_UTICK(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_UTICK_SHIFT)) & SYSCON_AHBCLKCTRL1_UTICK_MASK)

#define SYSCON_AHBCLKCTRL1_FC0_MASK              (0x800U)
#define SYSCON_AHBCLKCTRL1_FC0_SHIFT             (11U)
/*! FC0 - Enables the clock for LP_FLEXCOMM0
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_FC0(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_FC0_SHIFT)) & SYSCON_AHBCLKCTRL1_FC0_MASK)

#define SYSCON_AHBCLKCTRL1_FC1_MASK              (0x1000U)
#define SYSCON_AHBCLKCTRL1_FC1_SHIFT             (12U)
/*! FC1 - Enables the clock for LP_FLEXCOMM1
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_FC1(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_FC1_SHIFT)) & SYSCON_AHBCLKCTRL1_FC1_MASK)

#define SYSCON_AHBCLKCTRL1_FC2_MASK              (0x2000U)
#define SYSCON_AHBCLKCTRL1_FC2_SHIFT             (13U)
/*! FC2 - Enables the clock for LP_FLEXCOMM2
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_FC2(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_FC2_SHIFT)) & SYSCON_AHBCLKCTRL1_FC2_MASK)

#define SYSCON_AHBCLKCTRL1_FC3_MASK              (0x4000U)
#define SYSCON_AHBCLKCTRL1_FC3_SHIFT             (14U)
/*! FC3 - Enables the clock for LP_FLEXCOMM3
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_FC3(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_FC3_SHIFT)) & SYSCON_AHBCLKCTRL1_FC3_MASK)

