zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXN/periph/PERI_SYSCON.h
#define SYSCON_AHBCLKCTRL1_FC4_MASK              (0x8000U)
#define SYSCON_AHBCLKCTRL1_FC4_SHIFT             (15U)
/*! FC4 - Enables the clock for LP_FLEXCOMM4
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_FC4(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_FC4_SHIFT)) & SYSCON_AHBCLKCTRL1_FC4_MASK)

#define SYSCON_AHBCLKCTRL1_FC5_MASK              (0x10000U)
#define SYSCON_AHBCLKCTRL1_FC5_SHIFT             (16U)
/*! FC5 - Enables the clock for LP_FLEXCOMM5
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_FC5(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_FC5_SHIFT)) & SYSCON_AHBCLKCTRL1_FC5_MASK)

#define SYSCON_AHBCLKCTRL1_FC6_MASK              (0x20000U)
#define SYSCON_AHBCLKCTRL1_FC6_SHIFT             (17U)
/*! FC6 - Enables the clock for LP_FLEXCOMM6
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_FC6(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_FC6_SHIFT)) & SYSCON_AHBCLKCTRL1_FC6_MASK)

#define SYSCON_AHBCLKCTRL1_FC7_MASK              (0x40000U)
#define SYSCON_AHBCLKCTRL1_FC7_SHIFT             (18U)
/*! FC7 - Enables the clock for LP_FLEXCOMM7
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_FC7(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_FC7_SHIFT)) & SYSCON_AHBCLKCTRL1_FC7_MASK)

#define SYSCON_AHBCLKCTRL1_FC8_MASK              (0x80000U)
#define SYSCON_AHBCLKCTRL1_FC8_SHIFT             (19U)
/*! FC8 - Enables the clock for LP_FLEXCOMM8
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_FC8(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_FC8_SHIFT)) & SYSCON_AHBCLKCTRL1_FC8_MASK)

#define SYSCON_AHBCLKCTRL1_FC9_MASK              (0x100000U)
#define SYSCON_AHBCLKCTRL1_FC9_SHIFT             (20U)
/*! FC9 - Enables the clock for LP_FLEXCOMM9
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_FC9(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_FC9_SHIFT)) & SYSCON_AHBCLKCTRL1_FC9_MASK)

#define SYSCON_AHBCLKCTRL1_MICFIL_MASK           (0x200000U)
#define SYSCON_AHBCLKCTRL1_MICFIL_SHIFT          (21U)
/*! MICFIL - Enables the clock for MICFIL
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_MICFIL(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_MICFIL_SHIFT)) & SYSCON_AHBCLKCTRL1_MICFIL_MASK)

#define SYSCON_AHBCLKCTRL1_TIMER2_MASK           (0x400000U)
#define SYSCON_AHBCLKCTRL1_TIMER2_SHIFT          (22U)
/*! TIMER2 - Enables the clock for CTIMER2
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_TIMER2(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_TIMER2_SHIFT)) & SYSCON_AHBCLKCTRL1_TIMER2_MASK)

#define SYSCON_AHBCLKCTRL1_USB0_FS_DCD_MASK      (0x1000000U)
#define SYSCON_AHBCLKCTRL1_USB0_FS_DCD_SHIFT     (24U)
/*! USB0_FS_DCD - Enables the clock for USB-FS DCD
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_USB0_FS_DCD(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_USB0_FS_DCD_SHIFT)) & SYSCON_AHBCLKCTRL1_USB0_FS_DCD_MASK)

#define SYSCON_AHBCLKCTRL1_USB0_FS_MASK          (0x2000000U)
#define SYSCON_AHBCLKCTRL1_USB0_FS_SHIFT         (25U)
/*! USB0_FS - Enables the clock for USB-FS
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_USB0_FS(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_USB0_FS_SHIFT)) & SYSCON_AHBCLKCTRL1_USB0_FS_MASK)

#define SYSCON_AHBCLKCTRL1_TIMER0_MASK           (0x4000000U)
#define SYSCON_AHBCLKCTRL1_TIMER0_SHIFT          (26U)
/*! TIMER0 - Enables the clock for CTIMER0
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_TIMER0(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_TIMER0_SHIFT)) & SYSCON_AHBCLKCTRL1_TIMER0_MASK)

#define SYSCON_AHBCLKCTRL1_TIMER1_MASK           (0x8000000U)
#define SYSCON_AHBCLKCTRL1_TIMER1_SHIFT          (27U)
/*! TIMER1 - Enables the clock for CTIMER1
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_TIMER1(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_TIMER1_SHIFT)) & SYSCON_AHBCLKCTRL1_TIMER1_MASK)

#define SYSCON_AHBCLKCTRL1_PKC_RAM_MASK          (0x20000000U)
#define SYSCON_AHBCLKCTRL1_PKC_RAM_SHIFT         (29U)
/*! PKC_RAM - Enables the clock for PKC RAM
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_PKC_RAM(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_PKC_RAM_SHIFT)) & SYSCON_AHBCLKCTRL1_PKC_RAM_MASK)

#define SYSCON_AHBCLKCTRL1_SmartDMA_MASK         (0x80000000U)
#define SYSCON_AHBCLKCTRL1_SmartDMA_SHIFT        (31U)
/*! SmartDMA - Enables the clock for SmartDMA
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL1_SmartDMA(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL1_SmartDMA_SHIFT)) & SYSCON_AHBCLKCTRL1_SmartDMA_MASK)
/*! @} */

/*! @name AHBCLKCTRL2 - AHB Clock Control 2 */
/*! @{ */

#define SYSCON_AHBCLKCTRL2_DMA1_MASK             (0x2U)
#define SYSCON_AHBCLKCTRL2_DMA1_SHIFT            (1U)
/*! DMA1 - Enables the clock for DMA1
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL2_DMA1(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL2_DMA1_SHIFT)) & SYSCON_AHBCLKCTRL2_DMA1_MASK)

#define SYSCON_AHBCLKCTRL2_ENET_MASK             (0x4U)
#define SYSCON_AHBCLKCTRL2_ENET_SHIFT            (2U)
/*! ENET - Enables the clock for Ethernet
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL2_ENET(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL2_ENET_SHIFT)) & SYSCON_AHBCLKCTRL2_ENET_MASK)

#define SYSCON_AHBCLKCTRL2_uSDHC_MASK            (0x8U)
#define SYSCON_AHBCLKCTRL2_uSDHC_SHIFT           (3U)
/*! uSDHC - Enables the clock for uSDHC
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL2_uSDHC(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL2_uSDHC_SHIFT)) & SYSCON_AHBCLKCTRL2_uSDHC_MASK)

#define SYSCON_AHBCLKCTRL2_FLEXIO_MASK           (0x10U)
#define SYSCON_AHBCLKCTRL2_FLEXIO_SHIFT          (4U)
/*! FLEXIO - Enables the clock for Flexio
 *  0b0..Disables clock
 *  0b1..Enable clock
 */
#define SYSCON_AHBCLKCTRL2_FLEXIO(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL2_FLEXIO_SHIFT)) & SYSCON_AHBCLKCTRL2_FLEXIO_MASK)

#define SYSCON_AHBCLKCTRL2_SAI0_MASK             (0x20U)
#define SYSCON_AHBCLKCTRL2_SAI0_SHIFT            (5U)
/*! SAI0 - Enables the clock for SAI0
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL2_SAI0(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL2_SAI0_SHIFT)) & SYSCON_AHBCLKCTRL2_SAI0_MASK)

