zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXN/periph/PERI_SYSCON.h
#define SYSCON_AHBCLKCTRL2_SAI1_MASK             (0x40U)
#define SYSCON_AHBCLKCTRL2_SAI1_SHIFT            (6U)
/*! SAI1 - Enables the clock for SAI1
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL2_SAI1(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL2_SAI1_SHIFT)) & SYSCON_AHBCLKCTRL2_SAI1_MASK)

#define SYSCON_AHBCLKCTRL2_TRO_MASK              (0x80U)
#define SYSCON_AHBCLKCTRL2_TRO_SHIFT             (7U)
/*! TRO - Enables the clock for TRO
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL2_TRO(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL2_TRO_SHIFT)) & SYSCON_AHBCLKCTRL2_TRO_MASK)

#define SYSCON_AHBCLKCTRL2_FREQME_MASK           (0x100U)
#define SYSCON_AHBCLKCTRL2_FREQME_SHIFT          (8U)
/*! FREQME - Enables the clock for the Frequency meter
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL2_FREQME(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL2_FREQME_SHIFT)) & SYSCON_AHBCLKCTRL2_FREQME_MASK)

#define SYSCON_AHBCLKCTRL2_TRNG_MASK             (0x2000U)
#define SYSCON_AHBCLKCTRL2_TRNG_SHIFT            (13U)
/*! TRNG - Enables the clock for TRNG
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL2_TRNG(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL2_TRNG_SHIFT)) & SYSCON_AHBCLKCTRL2_TRNG_MASK)

#define SYSCON_AHBCLKCTRL2_FLEXCAN0_MASK         (0x4000U)
#define SYSCON_AHBCLKCTRL2_FLEXCAN0_SHIFT        (14U)
/*! FLEXCAN0 - Enables the clock for FLEXCAN0
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL2_FLEXCAN0(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL2_FLEXCAN0_SHIFT)) & SYSCON_AHBCLKCTRL2_FLEXCAN0_MASK)

#define SYSCON_AHBCLKCTRL2_FLEXCAN1_MASK         (0x8000U)
#define SYSCON_AHBCLKCTRL2_FLEXCAN1_SHIFT        (15U)
/*! FLEXCAN1 - Enables the clock for FLEXCAN1
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL2_FLEXCAN1(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL2_FLEXCAN1_SHIFT)) & SYSCON_AHBCLKCTRL2_FLEXCAN1_MASK)

#define SYSCON_AHBCLKCTRL2_USB_HS_MASK           (0x10000U)
#define SYSCON_AHBCLKCTRL2_USB_HS_SHIFT          (16U)
/*! USB_HS - Enables the clock for USB HS
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL2_USB_HS(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL2_USB_HS_SHIFT)) & SYSCON_AHBCLKCTRL2_USB_HS_MASK)

#define SYSCON_AHBCLKCTRL2_USB_HS_PHY_MASK       (0x20000U)
#define SYSCON_AHBCLKCTRL2_USB_HS_PHY_SHIFT      (17U)
/*! USB_HS_PHY - Enables the clock for USB HS PHY
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL2_USB_HS_PHY(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL2_USB_HS_PHY_SHIFT)) & SYSCON_AHBCLKCTRL2_USB_HS_PHY_MASK)

#define SYSCON_AHBCLKCTRL2_ELS_MASK              (0x40000U)
#define SYSCON_AHBCLKCTRL2_ELS_SHIFT             (18U)
/*! ELS - Enables the clock for ELS
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL2_ELS(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL2_ELS_SHIFT)) & SYSCON_AHBCLKCTRL2_ELS_MASK)

#define SYSCON_AHBCLKCTRL2_PQ_MASK               (0x80000U)
#define SYSCON_AHBCLKCTRL2_PQ_SHIFT              (19U)
/*! PQ - Enables the clock for Powerquad
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL2_PQ(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL2_PQ_SHIFT)) & SYSCON_AHBCLKCTRL2_PQ_MASK)

#define SYSCON_AHBCLKCTRL2_PLU_LUT_MASK          (0x100000U)
#define SYSCON_AHBCLKCTRL2_PLU_LUT_SHIFT         (20U)
/*! PLU_LUT - Enables the clock for PLU_LUT
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL2_PLU_LUT(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL2_PLU_LUT_SHIFT)) & SYSCON_AHBCLKCTRL2_PLU_LUT_MASK)

#define SYSCON_AHBCLKCTRL2_TIMER3_MASK           (0x200000U)
#define SYSCON_AHBCLKCTRL2_TIMER3_SHIFT          (21U)
/*! TIMER3 - Enables the clock for CTIMER3
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL2_TIMER3(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL2_TIMER3_SHIFT)) & SYSCON_AHBCLKCTRL2_TIMER3_MASK)

#define SYSCON_AHBCLKCTRL2_TIMER4_MASK           (0x400000U)
#define SYSCON_AHBCLKCTRL2_TIMER4_SHIFT          (22U)
/*! TIMER4 - Enables the clock for CTIMER4
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL2_TIMER4(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL2_TIMER4_SHIFT)) & SYSCON_AHBCLKCTRL2_TIMER4_MASK)

#define SYSCON_AHBCLKCTRL2_PUF_MASK              (0x800000U)
#define SYSCON_AHBCLKCTRL2_PUF_SHIFT             (23U)
/*! PUF - Enables the clock for PUF
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL2_PUF(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL2_PUF_SHIFT)) & SYSCON_AHBCLKCTRL2_PUF_MASK)

#define SYSCON_AHBCLKCTRL2_PKC_MASK              (0x1000000U)
#define SYSCON_AHBCLKCTRL2_PKC_SHIFT             (24U)
/*! PKC - Enables the clock for PKC
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL2_PKC(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL2_PKC_SHIFT)) & SYSCON_AHBCLKCTRL2_PKC_MASK)

#define SYSCON_AHBCLKCTRL2_SCG_MASK              (0x4000000U)
#define SYSCON_AHBCLKCTRL2_SCG_SHIFT             (26U)
/*! SCG - Enables the clock for SCG
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL2_SCG(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL2_SCG_SHIFT)) & SYSCON_AHBCLKCTRL2_SCG_MASK)

#define SYSCON_AHBCLKCTRL2_GDET_MASK             (0x20000000U)
#define SYSCON_AHBCLKCTRL2_GDET_SHIFT            (29U)
/*! GDET - Enables the clock for GDET0 and GDET1
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL2_GDET(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL2_GDET_SHIFT)) & SYSCON_AHBCLKCTRL2_GDET_MASK)

#define SYSCON_AHBCLKCTRL2_SM3_MASK              (0x40000000U)
#define SYSCON_AHBCLKCTRL2_SM3_SHIFT             (30U)
/*! SM3 - Enables the clock for SM3
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL2_SM3(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL2_SM3_SHIFT)) & SYSCON_AHBCLKCTRL2_SM3_MASK)
/*! @} */

/*! @name AHBCLKCTRL3 - AHB Clock Control 3 */
/*! @{ */

#define SYSCON_AHBCLKCTRL3_I3C0_MASK             (0x1U)
#define SYSCON_AHBCLKCTRL3_I3C0_SHIFT            (0U)
/*! I3C0 - Enables the clock for I3C0
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL3_I3C0(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL3_I3C0_SHIFT)) & SYSCON_AHBCLKCTRL3_I3C0_MASK)

#define SYSCON_AHBCLKCTRL3_I3C1_MASK             (0x2U)
#define SYSCON_AHBCLKCTRL3_I3C1_SHIFT            (1U)
/*! I3C1 - Enables the clock for I3C1
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL3_I3C1(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL3_I3C1_SHIFT)) & SYSCON_AHBCLKCTRL3_I3C1_MASK)

