zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXN/periph/PERI_SYSCON.h
#define SYSCON_AHBCLKCTRL3_SINC_MASK             (0x4U)
#define SYSCON_AHBCLKCTRL3_SINC_SHIFT            (2U)
/*! SINC - Enables the clock for SINC
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL3_SINC(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL3_SINC_SHIFT)) & SYSCON_AHBCLKCTRL3_SINC_MASK)

#define SYSCON_AHBCLKCTRL3_COOLFLUX_MASK         (0x8U)
#define SYSCON_AHBCLKCTRL3_COOLFLUX_SHIFT        (3U)
/*! COOLFLUX - Enables the clock for CoolFlux
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL3_COOLFLUX(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL3_COOLFLUX_SHIFT)) & SYSCON_AHBCLKCTRL3_COOLFLUX_MASK)

#define SYSCON_AHBCLKCTRL3_QDC0_MASK             (0x10U)
#define SYSCON_AHBCLKCTRL3_QDC0_SHIFT            (4U)
/*! QDC0 - Enables the clock for QDC0
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL3_QDC0(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL3_QDC0_SHIFT)) & SYSCON_AHBCLKCTRL3_QDC0_MASK)

#define SYSCON_AHBCLKCTRL3_QDC1_MASK             (0x20U)
#define SYSCON_AHBCLKCTRL3_QDC1_SHIFT            (5U)
/*! QDC1 - Enables the clock for QDC1
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL3_QDC1(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL3_QDC1_SHIFT)) & SYSCON_AHBCLKCTRL3_QDC1_MASK)

#define SYSCON_AHBCLKCTRL3_PWM0_MASK             (0x40U)
#define SYSCON_AHBCLKCTRL3_PWM0_SHIFT            (6U)
/*! PWM0 - Enables the clock for PWM0
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL3_PWM0(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL3_PWM0_SHIFT)) & SYSCON_AHBCLKCTRL3_PWM0_MASK)

#define SYSCON_AHBCLKCTRL3_PWM1_MASK             (0x80U)
#define SYSCON_AHBCLKCTRL3_PWM1_SHIFT            (7U)
/*! PWM1 - Enables the clock for PWM1
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL3_PWM1(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL3_PWM1_SHIFT)) & SYSCON_AHBCLKCTRL3_PWM1_MASK)

#define SYSCON_AHBCLKCTRL3_EVTG_MASK             (0x100U)
#define SYSCON_AHBCLKCTRL3_EVTG_SHIFT            (8U)
/*! EVTG - Enables the clock for EVTG
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL3_EVTG(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL3_EVTG_SHIFT)) & SYSCON_AHBCLKCTRL3_EVTG_MASK)

#define SYSCON_AHBCLKCTRL3_DAC1_MASK             (0x800U)
#define SYSCON_AHBCLKCTRL3_DAC1_SHIFT            (11U)
/*! DAC1 - Enables the clock for DAC1
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL3_DAC1(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL3_DAC1_SHIFT)) & SYSCON_AHBCLKCTRL3_DAC1_MASK)

#define SYSCON_AHBCLKCTRL3_DAC2_MASK             (0x1000U)
#define SYSCON_AHBCLKCTRL3_DAC2_SHIFT            (12U)
/*! DAC2 - Enables the clock for DAC2
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL3_DAC2(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL3_DAC2_SHIFT)) & SYSCON_AHBCLKCTRL3_DAC2_MASK)

#define SYSCON_AHBCLKCTRL3_OPAMP0_MASK           (0x2000U)
#define SYSCON_AHBCLKCTRL3_OPAMP0_SHIFT          (13U)
/*! OPAMP0 - Enables the clock for OPAMP0
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL3_OPAMP0(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL3_OPAMP0_SHIFT)) & SYSCON_AHBCLKCTRL3_OPAMP0_MASK)

#define SYSCON_AHBCLKCTRL3_OPAMP1_MASK           (0x4000U)
#define SYSCON_AHBCLKCTRL3_OPAMP1_SHIFT          (14U)
/*! OPAMP1 - Enables the clock for OPAMP1
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL3_OPAMP1(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL3_OPAMP1_SHIFT)) & SYSCON_AHBCLKCTRL3_OPAMP1_MASK)

#define SYSCON_AHBCLKCTRL3_OPAMP2_MASK           (0x8000U)
#define SYSCON_AHBCLKCTRL3_OPAMP2_SHIFT          (15U)
/*! OPAMP2 - Enables the clock for OPAMP2
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL3_OPAMP2(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL3_OPAMP2_SHIFT)) & SYSCON_AHBCLKCTRL3_OPAMP2_MASK)

#define SYSCON_AHBCLKCTRL3_CMP2_MASK             (0x40000U)
#define SYSCON_AHBCLKCTRL3_CMP2_SHIFT            (18U)
/*! CMP2 - Enables the clock for CMP2
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL3_CMP2(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL3_CMP2_SHIFT)) & SYSCON_AHBCLKCTRL3_CMP2_MASK)

#define SYSCON_AHBCLKCTRL3_VREF_MASK             (0x80000U)
#define SYSCON_AHBCLKCTRL3_VREF_SHIFT            (19U)
/*! VREF - Enables the clock for VREF
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL3_VREF(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL3_VREF_SHIFT)) & SYSCON_AHBCLKCTRL3_VREF_MASK)

#define SYSCON_AHBCLKCTRL3_COOLFLUX_APB_MASK     (0x100000U)
#define SYSCON_AHBCLKCTRL3_COOLFLUX_APB_SHIFT    (20U)
/*! COOLFLUX_APB - Enables the clock for CoolFlux APB
 *  0b0..Disables clock
 *  0b1..Enables clock (CoolFlux needs to be properly programmed before the clock enabled.)
 */
#define SYSCON_AHBCLKCTRL3_COOLFLUX_APB(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL3_COOLFLUX_APB_SHIFT)) & SYSCON_AHBCLKCTRL3_COOLFLUX_APB_MASK)

#define SYSCON_AHBCLKCTRL3_NPU_MASK              (0x200000U)
#define SYSCON_AHBCLKCTRL3_NPU_SHIFT             (21U)
/*! NPU - Enables the clock for NPU
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL3_NPU(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL3_NPU_SHIFT)) & SYSCON_AHBCLKCTRL3_NPU_MASK)

#define SYSCON_AHBCLKCTRL3_TSI_MASK              (0x400000U)
#define SYSCON_AHBCLKCTRL3_TSI_SHIFT             (22U)
/*! TSI - Enables the clock for TSI
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL3_TSI(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL3_TSI_SHIFT)) & SYSCON_AHBCLKCTRL3_TSI_MASK)

#define SYSCON_AHBCLKCTRL3_EWM_MASK              (0x800000U)
#define SYSCON_AHBCLKCTRL3_EWM_SHIFT             (23U)
/*! EWM - Enables the clock for EWM
 *  0b0..Disables clock
 *  0b1..Enables clock
 */
#define SYSCON_AHBCLKCTRL3_EWM(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_AHBCLKCTRL3_EWM_SHIFT)) & SYSCON_AHBCLKCTRL3_EWM_MASK)

