zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXN/periph/PERI_SYSCON.h
/*! @name PLLCLKDIVSEL - PLL Clock Divider Clock Selection */
/*! @{ */

#define SYSCON_PLLCLKDIVSEL_SEL_MASK             (0x7U)
#define SYSCON_PLLCLKDIVSEL_SEL_SHIFT            (0U)
/*! SEL - Selects the PLL Clock Divider source clock
 *  0b000..PLL0 clock
 *  0b001..pll1_clk0
 *  0b010..No clock
 *  0b011..No clock
 *  0b100..No clock
 *  0b101..No clock
 *  0b110..No clock
 *  0b111..No clock
 */
#define SYSCON_PLLCLKDIVSEL_SEL(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_PLLCLKDIVSEL_SEL_SHIFT)) & SYSCON_PLLCLKDIVSEL_SEL_MASK)
/*! @} */

/*! @name I3C0FCLKSEL - I3C0 Functional Clock Selection */
/*! @{ */

#define SYSCON_I3C0FCLKSEL_SEL_MASK              (0x7U)
#define SYSCON_I3C0FCLKSEL_SEL_SHIFT             (0U)
/*! SEL - Selects the I3C0 clock
 *  0b000..No clock
 *  0b001..PLL0 clock
 *  0b010..CLKIN clock
 *  0b011..FRO_HF clock
 *  0b100..No clock
 *  0b101..PLL1_clk0 clock
 *  0b110..USB PLL clock
 *  0b111..No clock
 */
#define SYSCON_I3C0FCLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_I3C0FCLKSEL_SEL_SHIFT)) & SYSCON_I3C0FCLKSEL_SEL_MASK)
/*! @} */

/*! @name I3C0FCLKSTCSEL - I3C0 FCLK_STC Clock Selection */
/*! @{ */

#define SYSCON_I3C0FCLKSTCSEL_SEL_MASK           (0x7U)
#define SYSCON_I3C0FCLKSTCSEL_SEL_SHIFT          (0U)
/*! SEL - Selects the I3C0 Time Control clock
 *  0b000..I3C0 functional clock I3C0FCLK
 *  0b001..FRO_1M clock
 *  0b010..No clock
 *  0b011..No clock
 *  0b100..No clock
 *  0b101..No clock
 *  0b110..No clock
 *  0b111..No clock
 */
#define SYSCON_I3C0FCLKSTCSEL_SEL(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_I3C0FCLKSTCSEL_SEL_SHIFT)) & SYSCON_I3C0FCLKSTCSEL_SEL_MASK)
/*! @} */

/*! @name I3C0FCLKSTCDIV - I3C0 FCLK_STC Clock Divider */
/*! @{ */

#define SYSCON_I3C0FCLKSTCDIV_DIV_MASK           (0xFFU)
#define SYSCON_I3C0FCLKSTCDIV_DIV_SHIFT          (0U)
/*! DIV - Clock divider value */
#define SYSCON_I3C0FCLKSTCDIV_DIV(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_I3C0FCLKSTCDIV_DIV_SHIFT)) & SYSCON_I3C0FCLKSTCDIV_DIV_MASK)

#define SYSCON_I3C0FCLKSTCDIV_RESET_MASK         (0x20000000U)
#define SYSCON_I3C0FCLKSTCDIV_RESET_SHIFT        (29U)
/*! RESET - Resets the divider counter
 *  0b0..Divider is not reset
 *  0b1..Divider is reset
 */
#define SYSCON_I3C0FCLKSTCDIV_RESET(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_I3C0FCLKSTCDIV_RESET_SHIFT)) & SYSCON_I3C0FCLKSTCDIV_RESET_MASK)

#define SYSCON_I3C0FCLKSTCDIV_HALT_MASK          (0x40000000U)
#define SYSCON_I3C0FCLKSTCDIV_HALT_SHIFT         (30U)
/*! HALT - Halts the divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define SYSCON_I3C0FCLKSTCDIV_HALT(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_I3C0FCLKSTCDIV_HALT_SHIFT)) & SYSCON_I3C0FCLKSTCDIV_HALT_MASK)

#define SYSCON_I3C0FCLKSTCDIV_UNSTAB_MASK        (0x80000000U)
#define SYSCON_I3C0FCLKSTCDIV_UNSTAB_SHIFT       (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency is not stable
 */
#define SYSCON_I3C0FCLKSTCDIV_UNSTAB(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_I3C0FCLKSTCDIV_UNSTAB_SHIFT)) & SYSCON_I3C0FCLKSTCDIV_UNSTAB_MASK)
/*! @} */

/*! @name I3C0FCLKSDIV - I3C0 FCLK Slow Clock Divider */
/*! @{ */

#define SYSCON_I3C0FCLKSDIV_DIV_MASK             (0xFFU)
#define SYSCON_I3C0FCLKSDIV_DIV_SHIFT            (0U)
/*! DIV - Clock divider value */
#define SYSCON_I3C0FCLKSDIV_DIV(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_I3C0FCLKSDIV_DIV_SHIFT)) & SYSCON_I3C0FCLKSDIV_DIV_MASK)

#define SYSCON_I3C0FCLKSDIV_RESET_MASK           (0x20000000U)
#define SYSCON_I3C0FCLKSDIV_RESET_SHIFT          (29U)
/*! RESET - Resets the divider counter
 *  0b0..Divider is not reset
 *  0b1..Divider is reset
 */
#define SYSCON_I3C0FCLKSDIV_RESET(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_I3C0FCLKSDIV_RESET_SHIFT)) & SYSCON_I3C0FCLKSDIV_RESET_MASK)

#define SYSCON_I3C0FCLKSDIV_HALT_MASK            (0x40000000U)
#define SYSCON_I3C0FCLKSDIV_HALT_SHIFT           (30U)
/*! HALT - Halts the divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define SYSCON_I3C0FCLKSDIV_HALT(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_I3C0FCLKSDIV_HALT_SHIFT)) & SYSCON_I3C0FCLKSDIV_HALT_MASK)

#define SYSCON_I3C0FCLKSDIV_UNSTAB_MASK          (0x80000000U)
#define SYSCON_I3C0FCLKSDIV_UNSTAB_SHIFT         (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency is not stable
 */
#define SYSCON_I3C0FCLKSDIV_UNSTAB(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_I3C0FCLKSDIV_UNSTAB_SHIFT)) & SYSCON_I3C0FCLKSDIV_UNSTAB_MASK)
/*! @} */

/*! @name I3C0FCLKDIV - I3C0 Functional Clock FCLK Divider */
/*! @{ */

#define SYSCON_I3C0FCLKDIV_DIV_MASK              (0xFFU)
#define SYSCON_I3C0FCLKDIV_DIV_SHIFT             (0U)
/*! DIV - Clock divider value */
#define SYSCON_I3C0FCLKDIV_DIV(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_I3C0FCLKDIV_DIV_SHIFT)) & SYSCON_I3C0FCLKDIV_DIV_MASK)

#define SYSCON_I3C0FCLKDIV_RESET_MASK            (0x20000000U)
#define SYSCON_I3C0FCLKDIV_RESET_SHIFT           (29U)
/*! RESET - Resets the divider counter
 *  0b0..Divider is not reset
 *  0b1..Divider is reset
 */
#define SYSCON_I3C0FCLKDIV_RESET(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_I3C0FCLKDIV_RESET_SHIFT)) & SYSCON_I3C0FCLKDIV_RESET_MASK)

#define SYSCON_I3C0FCLKDIV_HALT_MASK             (0x40000000U)
#define SYSCON_I3C0FCLKDIV_HALT_SHIFT            (30U)
/*! HALT - Halts the divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define SYSCON_I3C0FCLKDIV_HALT(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_I3C0FCLKDIV_HALT_SHIFT)) & SYSCON_I3C0FCLKDIV_HALT_MASK)

#define SYSCON_I3C0FCLKDIV_UNSTAB_MASK           (0x80000000U)
#define SYSCON_I3C0FCLKDIV_UNSTAB_SHIFT          (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency is not stable
 */
#define SYSCON_I3C0FCLKDIV_UNSTAB(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_I3C0FCLKDIV_UNSTAB_SHIFT)) & SYSCON_I3C0FCLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name I3C0FCLKSSEL - I3C0 FCLK Slow Selection */
/*! @{ */

