zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXN/periph/PERI_SYSCON.h
#define SYSCON_I3C0FCLKSSEL_SEL_MASK             (0x7U)
#define SYSCON_I3C0FCLKSSEL_SEL_SHIFT            (0U)
/*! SEL - Selects the I3C FCLK Slow clock
 *  0b000..FRO_1M clock
 *  0b001..No clock
 *  0b010..No clock
 *  0b011..No clock
 *  0b100..No clock
 *  0b101..No clock
 *  0b110..No clock
 *  0b111..No clock
 */
#define SYSCON_I3C0FCLKSSEL_SEL(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_I3C0FCLKSSEL_SEL_SHIFT)) & SYSCON_I3C0FCLKSSEL_SEL_MASK)
/*! @} */

/*! @name MICFILFCLKSEL - MICFIL Clock Selection */
/*! @{ */

#define SYSCON_MICFILFCLKSEL_SEL_MASK            (0xFU)
#define SYSCON_MICFILFCLKSEL_SEL_SHIFT           (0U)
/*! SEL - Selects the MICFIL clock
 *  0b0000..FRO_12M clock
 *  0b0001..PLL0 clock
 *  0b0010..CLKIN clock
 *  0b0011..FRO_HF clock
 *  0b0100..PLL1_clk0 clock
 *  0b0101..SAI0_MCLK clock
 *  0b0110..USB PLL clock
 *  0b0111..No clock
 *  0b1000..SAI1_MCLK clock
 *  0b1001..No clock
 *  0b1010..No clock
 *  0b1011..No clock
 *  0b1100..No clock
 *  0b1101..No clock
 *  0b1110..No clock
 *  0b1111..No clock
 */
#define SYSCON_MICFILFCLKSEL_SEL(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_MICFILFCLKSEL_SEL_SHIFT)) & SYSCON_MICFILFCLKSEL_SEL_MASK)
/*! @} */

/*! @name MICFILFCLKDIV - MICFIL Clock Division */
/*! @{ */

#define SYSCON_MICFILFCLKDIV_DIV_MASK            (0x7U)
#define SYSCON_MICFILFCLKDIV_DIV_SHIFT           (0U)
/*! DIV - Clock divider value */
#define SYSCON_MICFILFCLKDIV_DIV(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_MICFILFCLKDIV_DIV_SHIFT)) & SYSCON_MICFILFCLKDIV_DIV_MASK)

#define SYSCON_MICFILFCLKDIV_RESET_MASK          (0x20000000U)
#define SYSCON_MICFILFCLKDIV_RESET_SHIFT         (29U)
/*! RESET - Resets the divider counter
 *  0b0..Divider is not reset
 *  0b1..Divider is reset
 */
#define SYSCON_MICFILFCLKDIV_RESET(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_MICFILFCLKDIV_RESET_SHIFT)) & SYSCON_MICFILFCLKDIV_RESET_MASK)

#define SYSCON_MICFILFCLKDIV_HALT_MASK           (0x40000000U)
#define SYSCON_MICFILFCLKDIV_HALT_SHIFT          (30U)
/*! HALT - Halts the divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define SYSCON_MICFILFCLKDIV_HALT(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_MICFILFCLKDIV_HALT_SHIFT)) & SYSCON_MICFILFCLKDIV_HALT_MASK)

#define SYSCON_MICFILFCLKDIV_UNSTAB_MASK         (0x80000000U)
#define SYSCON_MICFILFCLKDIV_UNSTAB_SHIFT        (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency is not stable
 */
#define SYSCON_MICFILFCLKDIV_UNSTAB(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_MICFILFCLKDIV_UNSTAB_SHIFT)) & SYSCON_MICFILFCLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name USDHCCLKSEL - uSDHC Clock Selection */
/*! @{ */

#define SYSCON_USDHCCLKSEL_SEL_MASK              (0x7U)
#define SYSCON_USDHCCLKSEL_SEL_SHIFT             (0U)
/*! SEL - Selects the uSDHC clock
 *  0b000..No clock
 *  0b001..PLL0 clock
 *  0b010..CLKIN clock
 *  0b011..FRO_HF clock
 *  0b100..FRO_12M clock
 *  0b101..pll1_clk1 clock
 *  0b110..USB PLL clock
 *  0b111..No clock
 */
#define SYSCON_USDHCCLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_USDHCCLKSEL_SEL_SHIFT)) & SYSCON_USDHCCLKSEL_SEL_MASK)
/*! @} */

/*! @name USDHCCLKDIV - uSDHC Function Clock Divider */
/*! @{ */

#define SYSCON_USDHCCLKDIV_DIV_MASK              (0xFFU)
#define SYSCON_USDHCCLKDIV_DIV_SHIFT             (0U)
/*! DIV - Clock divider value */
#define SYSCON_USDHCCLKDIV_DIV(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_USDHCCLKDIV_DIV_SHIFT)) & SYSCON_USDHCCLKDIV_DIV_MASK)

#define SYSCON_USDHCCLKDIV_RESET_MASK            (0x20000000U)
#define SYSCON_USDHCCLKDIV_RESET_SHIFT           (29U)
/*! RESET - Resets the divider counter
 *  0b0..Divider is not reset
 *  0b1..Divider is reset
 */
#define SYSCON_USDHCCLKDIV_RESET(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_USDHCCLKDIV_RESET_SHIFT)) & SYSCON_USDHCCLKDIV_RESET_MASK)

#define SYSCON_USDHCCLKDIV_HALT_MASK             (0x40000000U)
#define SYSCON_USDHCCLKDIV_HALT_SHIFT            (30U)
/*! HALT - Halts the divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define SYSCON_USDHCCLKDIV_HALT(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_USDHCCLKDIV_HALT_SHIFT)) & SYSCON_USDHCCLKDIV_HALT_MASK)

#define SYSCON_USDHCCLKDIV_UNSTAB_MASK           (0x80000000U)
#define SYSCON_USDHCCLKDIV_UNSTAB_SHIFT          (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency is not stable
 */
#define SYSCON_USDHCCLKDIV_UNSTAB(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_USDHCCLKDIV_UNSTAB_SHIFT)) & SYSCON_USDHCCLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name FLEXIOCLKSEL - FLEXIO Clock Selection */
/*! @{ */

#define SYSCON_FLEXIOCLKSEL_SEL_MASK             (0x7U)
#define SYSCON_FLEXIOCLKSEL_SEL_SHIFT            (0U)
/*! SEL - Selects the FLEXIO clock
 *  0b000..No clock
 *  0b001..PLL0 clock
 *  0b010..CLKIN clock
 *  0b011..FRO_HF clock
 *  0b100..FRO_12M clock
 *  0b101..PLL1_clk0 clock
 *  0b110..USB PLL clock
 *  0b111..No clock
 */
#define SYSCON_FLEXIOCLKSEL_SEL(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_FLEXIOCLKSEL_SEL_SHIFT)) & SYSCON_FLEXIOCLKSEL_SEL_MASK)
/*! @} */

/*! @name FLEXIOCLKDIV - FLEXIO Function Clock Divider */
/*! @{ */

#define SYSCON_FLEXIOCLKDIV_DIV_MASK             (0xFFU)
#define SYSCON_FLEXIOCLKDIV_DIV_SHIFT            (0U)
/*! DIV - Clock divider value */
#define SYSCON_FLEXIOCLKDIV_DIV(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_FLEXIOCLKDIV_DIV_SHIFT)) & SYSCON_FLEXIOCLKDIV_DIV_MASK)

#define SYSCON_FLEXIOCLKDIV_RESET_MASK           (0x20000000U)
#define SYSCON_FLEXIOCLKDIV_RESET_SHIFT          (29U)
/*! RESET - Resets the divider counter
 *  0b0..Divider is not reset
 *  0b1..Divider is reset
 */
#define SYSCON_FLEXIOCLKDIV_RESET(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_FLEXIOCLKDIV_RESET_SHIFT)) & SYSCON_FLEXIOCLKDIV_RESET_MASK)

#define SYSCON_FLEXIOCLKDIV_HALT_MASK            (0x40000000U)
#define SYSCON_FLEXIOCLKDIV_HALT_SHIFT           (30U)
/*! HALT - Halts the divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define SYSCON_FLEXIOCLKDIV_HALT(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_FLEXIOCLKDIV_HALT_SHIFT)) & SYSCON_FLEXIOCLKDIV_HALT_MASK)

