zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXN/periph/PERI_SYSCON.h
#define SYSCON_FLEXIOCLKDIV_UNSTAB_MASK          (0x80000000U)
#define SYSCON_FLEXIOCLKDIV_UNSTAB_SHIFT         (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency is not stable
 */
#define SYSCON_FLEXIOCLKDIV_UNSTAB(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_FLEXIOCLKDIV_UNSTAB_SHIFT)) & SYSCON_FLEXIOCLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name FLEXCAN0CLKSEL - FLEXCAN0 Clock Selection */
/*! @{ */

#define SYSCON_FLEXCAN0CLKSEL_SEL_MASK           (0x7U)
#define SYSCON_FLEXCAN0CLKSEL_SEL_SHIFT          (0U)
/*! SEL - Selects the FLEXCAN0 clock
 *  0b000..No clock
 *  0b001..PLL0 clock
 *  0b010..CLKIN clock
 *  0b011..FRO_HF clock
 *  0b100..No clock
 *  0b101..PLL1_clk0 clock
 *  0b110..USB PLL clock
 *  0b111..No clock
 */
#define SYSCON_FLEXCAN0CLKSEL_SEL(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_FLEXCAN0CLKSEL_SEL_SHIFT)) & SYSCON_FLEXCAN0CLKSEL_SEL_MASK)
/*! @} */

/*! @name FLEXCAN0CLKDIV - FLEXCAN0 Function Clock Divider */
/*! @{ */

#define SYSCON_FLEXCAN0CLKDIV_DIV_MASK           (0xFFU)
#define SYSCON_FLEXCAN0CLKDIV_DIV_SHIFT          (0U)
/*! DIV - Clock divider value */
#define SYSCON_FLEXCAN0CLKDIV_DIV(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_FLEXCAN0CLKDIV_DIV_SHIFT)) & SYSCON_FLEXCAN0CLKDIV_DIV_MASK)

#define SYSCON_FLEXCAN0CLKDIV_RESET_MASK         (0x20000000U)
#define SYSCON_FLEXCAN0CLKDIV_RESET_SHIFT        (29U)
/*! RESET - Resets the divider counter
 *  0b0..Divider is not reset
 *  0b1..Divider is reset
 */
#define SYSCON_FLEXCAN0CLKDIV_RESET(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_FLEXCAN0CLKDIV_RESET_SHIFT)) & SYSCON_FLEXCAN0CLKDIV_RESET_MASK)

#define SYSCON_FLEXCAN0CLKDIV_HALT_MASK          (0x40000000U)
#define SYSCON_FLEXCAN0CLKDIV_HALT_SHIFT         (30U)
/*! HALT - Halts the divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define SYSCON_FLEXCAN0CLKDIV_HALT(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_FLEXCAN0CLKDIV_HALT_SHIFT)) & SYSCON_FLEXCAN0CLKDIV_HALT_MASK)

#define SYSCON_FLEXCAN0CLKDIV_UNSTAB_MASK        (0x80000000U)
#define SYSCON_FLEXCAN0CLKDIV_UNSTAB_SHIFT       (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency is not stable
 */
#define SYSCON_FLEXCAN0CLKDIV_UNSTAB(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_FLEXCAN0CLKDIV_UNSTAB_SHIFT)) & SYSCON_FLEXCAN0CLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name FLEXCAN1CLKSEL - FLEXCAN1 Clock Selection */
/*! @{ */

#define SYSCON_FLEXCAN1CLKSEL_SEL_MASK           (0x7U)
#define SYSCON_FLEXCAN1CLKSEL_SEL_SHIFT          (0U)
/*! SEL - Selects the FLEXCAN1 clock
 *  0b000..No clock
 *  0b001..PLL0 clock
 *  0b010..CLKIN clock
 *  0b011..FRO_HF clock
 *  0b100..No clock
 *  0b101..PLL1_clk0 clock
 *  0b110..USB PLL clock
 *  0b111..No clock
 */
#define SYSCON_FLEXCAN1CLKSEL_SEL(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_FLEXCAN1CLKSEL_SEL_SHIFT)) & SYSCON_FLEXCAN1CLKSEL_SEL_MASK)
/*! @} */

/*! @name FLEXCAN1CLKDIV - FLEXCAN1 Function Clock Divider */
/*! @{ */

#define SYSCON_FLEXCAN1CLKDIV_DIV_MASK           (0xFFU)
#define SYSCON_FLEXCAN1CLKDIV_DIV_SHIFT          (0U)
/*! DIV - Clock divider value */
#define SYSCON_FLEXCAN1CLKDIV_DIV(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_FLEXCAN1CLKDIV_DIV_SHIFT)) & SYSCON_FLEXCAN1CLKDIV_DIV_MASK)

#define SYSCON_FLEXCAN1CLKDIV_RESET_MASK         (0x20000000U)
#define SYSCON_FLEXCAN1CLKDIV_RESET_SHIFT        (29U)
/*! RESET - Resets the divider counter
 *  0b0..Divider is not reset
 *  0b1..Divider is reset
 */
#define SYSCON_FLEXCAN1CLKDIV_RESET(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_FLEXCAN1CLKDIV_RESET_SHIFT)) & SYSCON_FLEXCAN1CLKDIV_RESET_MASK)

#define SYSCON_FLEXCAN1CLKDIV_HALT_MASK          (0x40000000U)
#define SYSCON_FLEXCAN1CLKDIV_HALT_SHIFT         (30U)
/*! HALT - Halts the divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define SYSCON_FLEXCAN1CLKDIV_HALT(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_FLEXCAN1CLKDIV_HALT_SHIFT)) & SYSCON_FLEXCAN1CLKDIV_HALT_MASK)

#define SYSCON_FLEXCAN1CLKDIV_UNSTAB_MASK        (0x80000000U)
#define SYSCON_FLEXCAN1CLKDIV_UNSTAB_SHIFT       (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency is not stable
 */
#define SYSCON_FLEXCAN1CLKDIV_UNSTAB(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_FLEXCAN1CLKDIV_UNSTAB_SHIFT)) & SYSCON_FLEXCAN1CLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name ENETRMIICLKSEL - Ethernet RMII Clock Selection */
/*! @{ */

#define SYSCON_ENETRMIICLKSEL_SEL_MASK           (0x7U)
#define SYSCON_ENETRMIICLKSEL_SEL_SHIFT          (0U)
/*! SEL - Selects the Ethernet RMII clock
 *  0b000..No clock
 *  0b001..PLL0 clock
 *  0b010..CLKIN clock
 *  0b011..No clock
 *  0b100..No clock
 *  0b101..PLL1_clk0 clock
 *  0b110..No clock
 *  0b111..No clock
 */
#define SYSCON_ENETRMIICLKSEL_SEL(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_ENETRMIICLKSEL_SEL_SHIFT)) & SYSCON_ENETRMIICLKSEL_SEL_MASK)
/*! @} */

/*! @name ENETRMIICLKDIV - Ethernet RMII Function Clock Divider */
/*! @{ */

#define SYSCON_ENETRMIICLKDIV_DIV_MASK           (0xFFU)
#define SYSCON_ENETRMIICLKDIV_DIV_SHIFT          (0U)
/*! DIV - Clock divider value */
#define SYSCON_ENETRMIICLKDIV_DIV(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_ENETRMIICLKDIV_DIV_SHIFT)) & SYSCON_ENETRMIICLKDIV_DIV_MASK)

#define SYSCON_ENETRMIICLKDIV_RESET_MASK         (0x20000000U)
#define SYSCON_ENETRMIICLKDIV_RESET_SHIFT        (29U)
/*! RESET - Resets the divider counter
 *  0b0..Divider is not reset
 *  0b1..Divider is reset
 */
#define SYSCON_ENETRMIICLKDIV_RESET(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_ENETRMIICLKDIV_RESET_SHIFT)) & SYSCON_ENETRMIICLKDIV_RESET_MASK)

#define SYSCON_ENETRMIICLKDIV_HALT_MASK          (0x40000000U)
#define SYSCON_ENETRMIICLKDIV_HALT_SHIFT         (30U)
/*! HALT - Halts the divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define SYSCON_ENETRMIICLKDIV_HALT(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_ENETRMIICLKDIV_HALT_SHIFT)) & SYSCON_ENETRMIICLKDIV_HALT_MASK)

#define SYSCON_ENETRMIICLKDIV_UNSTAB_MASK        (0x80000000U)
#define SYSCON_ENETRMIICLKDIV_UNSTAB_SHIFT       (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency is not stable
 */
#define SYSCON_ENETRMIICLKDIV_UNSTAB(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_ENETRMIICLKDIV_UNSTAB_SHIFT)) & SYSCON_ENETRMIICLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name ENETPTPREFCLKSEL - Ethernet PTP REF Clock Selection */
/*! @{ */

#define SYSCON_ENETPTPREFCLKSEL_SEL_MASK         (0x7U)
#define SYSCON_ENETPTPREFCLKSEL_SEL_SHIFT        (0U)
/*! SEL - Selects the Ethernet PTP REF clock
 *  0b000..No clock
 *  0b001..PLL0 clock
 *  0b010..CLKIN clock
 *  0b011..No clock
 *  0b100..enet0_tx_clk clock
 *  0b101..pll1_clk1 clock
 *  0b110..No clock
 *  0b111..No clock
 */
#define SYSCON_ENETPTPREFCLKSEL_SEL(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_ENETPTPREFCLKSEL_SEL_SHIFT)) & SYSCON_ENETPTPREFCLKSEL_SEL_MASK)
/*! @} */

/*! @name ENETPTPREFCLKDIV - Ethernet PTP REF Function Clock Divider */
/*! @{ */

#define SYSCON_ENETPTPREFCLKDIV_DIV_MASK         (0xFFU)
#define SYSCON_ENETPTPREFCLKDIV_DIV_SHIFT        (0U)
/*! DIV - Clock divider value */
#define SYSCON_ENETPTPREFCLKDIV_DIV(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_ENETPTPREFCLKDIV_DIV_SHIFT)) & SYSCON_ENETPTPREFCLKDIV_DIV_MASK)

