zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXN/periph/PERI_SYSCON.h
#define SYSCON_ENETPTPREFCLKDIV_RESET_MASK       (0x20000000U)
#define SYSCON_ENETPTPREFCLKDIV_RESET_SHIFT      (29U)
/*! RESET - Resets the divider counter
 *  0b0..Divider is not reset
 *  0b1..Divider is reset
 */
#define SYSCON_ENETPTPREFCLKDIV_RESET(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_ENETPTPREFCLKDIV_RESET_SHIFT)) & SYSCON_ENETPTPREFCLKDIV_RESET_MASK)

#define SYSCON_ENETPTPREFCLKDIV_HALT_MASK        (0x40000000U)
#define SYSCON_ENETPTPREFCLKDIV_HALT_SHIFT       (30U)
/*! HALT - Halts the divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define SYSCON_ENETPTPREFCLKDIV_HALT(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_ENETPTPREFCLKDIV_HALT_SHIFT)) & SYSCON_ENETPTPREFCLKDIV_HALT_MASK)

#define SYSCON_ENETPTPREFCLKDIV_UNSTAB_MASK      (0x80000000U)
#define SYSCON_ENETPTPREFCLKDIV_UNSTAB_SHIFT     (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency is not stable
 */
#define SYSCON_ENETPTPREFCLKDIV_UNSTAB(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON_ENETPTPREFCLKDIV_UNSTAB_SHIFT)) & SYSCON_ENETPTPREFCLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name ENET_PHY_INTF_SEL - Ethernet PHY Interface Select */
/*! @{ */

#define SYSCON_ENET_PHY_INTF_SEL_PHY_SEL_MASK    (0x4U)
#define SYSCON_ENET_PHY_INTF_SEL_PHY_SEL_SHIFT   (2U)
/*! PHY_SEL - Selects the PHY interface
 *  0b0..Selects MII PHY Interface
 *  0b1..Selects RMII PHY Interface
 */
#define SYSCON_ENET_PHY_INTF_SEL_PHY_SEL(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON_ENET_PHY_INTF_SEL_PHY_SEL_SHIFT)) & SYSCON_ENET_PHY_INTF_SEL_PHY_SEL_MASK)
/*! @} */

/*! @name ENET_SBD_FLOW_CTRL - Sideband Flow Control */
/*! @{ */

#define SYSCON_ENET_SBD_FLOW_CTRL_SEL_ch0_MASK   (0x1U)
#define SYSCON_ENET_SBD_FLOW_CTRL_SEL_ch0_SHIFT  (0U)
/*! SEL_ch0 - Sideband Flow Control for channel0
 *  0b0..No trigger flow control
 *  0b1..Trigger flow control
 */
#define SYSCON_ENET_SBD_FLOW_CTRL_SEL_ch0(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON_ENET_SBD_FLOW_CTRL_SEL_ch0_SHIFT)) & SYSCON_ENET_SBD_FLOW_CTRL_SEL_ch0_MASK)

#define SYSCON_ENET_SBD_FLOW_CTRL_SEL_ch1_MASK   (0x2U)
#define SYSCON_ENET_SBD_FLOW_CTRL_SEL_ch1_SHIFT  (1U)
/*! SEL_ch1 - Sideband Flow Control for channel1
 *  0b0..No trigger flow control
 *  0b1..Trigger flow control
 */
#define SYSCON_ENET_SBD_FLOW_CTRL_SEL_ch1(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON_ENET_SBD_FLOW_CTRL_SEL_ch1_SHIFT)) & SYSCON_ENET_SBD_FLOW_CTRL_SEL_ch1_MASK)
/*! @} */

/*! @name EWM0CLKSEL - EWM0 Clock Selection */
/*! @{ */

#define SYSCON_EWM0CLKSEL_SEL_MASK               (0x1U)
#define SYSCON_EWM0CLKSEL_SEL_SHIFT              (0U)
/*! SEL - Selects the EWM0 clock
 *  0b0..clk_16k[2]
 *  0b1..xtal32k[2]
 */
#define SYSCON_EWM0CLKSEL_SEL(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCON_EWM0CLKSEL_SEL_SHIFT)) & SYSCON_EWM0CLKSEL_SEL_MASK)
/*! @} */

/*! @name WDT1CLKSEL - WDT1 Clock Selection */
/*! @{ */

#define SYSCON_WDT1CLKSEL_SEL_MASK               (0x3U)
#define SYSCON_WDT1CLKSEL_SEL_SHIFT              (0U)
/*! SEL - Selects the WDT1 clock
 *  0b00..FRO16K clock 2
 *  0b01..fro_hf_div clock
 *  0b10..clk_1m clock
 *  0b11..clk_1m clock
 */
#define SYSCON_WDT1CLKSEL_SEL(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCON_WDT1CLKSEL_SEL_SHIFT)) & SYSCON_WDT1CLKSEL_SEL_MASK)
/*! @} */

/*! @name WDT1CLKDIV - WDT1 Function Clock Divider */
/*! @{ */

#define SYSCON_WDT1CLKDIV_DIV_MASK               (0x3FU)
#define SYSCON_WDT1CLKDIV_DIV_SHIFT              (0U)
/*! DIV - Clock divider value */
#define SYSCON_WDT1CLKDIV_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCON_WDT1CLKDIV_DIV_SHIFT)) & SYSCON_WDT1CLKDIV_DIV_MASK)

#define SYSCON_WDT1CLKDIV_RESET_MASK             (0x20000000U)
#define SYSCON_WDT1CLKDIV_RESET_SHIFT            (29U)
/*! RESET - Resets the divider counter
 *  0b0..Divider is not reset
 *  0b1..Divider is reset
 */
#define SYSCON_WDT1CLKDIV_RESET(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_WDT1CLKDIV_RESET_SHIFT)) & SYSCON_WDT1CLKDIV_RESET_MASK)

#define SYSCON_WDT1CLKDIV_HALT_MASK              (0x40000000U)
#define SYSCON_WDT1CLKDIV_HALT_SHIFT             (30U)
/*! HALT - Halts the divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define SYSCON_WDT1CLKDIV_HALT(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_WDT1CLKDIV_HALT_SHIFT)) & SYSCON_WDT1CLKDIV_HALT_MASK)

#define SYSCON_WDT1CLKDIV_UNSTAB_MASK            (0x80000000U)
#define SYSCON_WDT1CLKDIV_UNSTAB_SHIFT           (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency is not stable
 */
#define SYSCON_WDT1CLKDIV_UNSTAB(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_WDT1CLKDIV_UNSTAB_SHIFT)) & SYSCON_WDT1CLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name OSTIMERCLKSEL - OSTIMER Clock Selection */
/*! @{ */

#define SYSCON_OSTIMERCLKSEL_SEL_MASK            (0x3U)
#define SYSCON_OSTIMERCLKSEL_SEL_SHIFT           (0U)
/*! SEL - Selects the OS Event Timer clock
 *  0b00..clk_16k[2]
 *  0b01..xtal32k[2]
 *  0b10..clk_1m clock
 *  0b11..No clock
 */
#define SYSCON_OSTIMERCLKSEL_SEL(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_OSTIMERCLKSEL_SEL_SHIFT)) & SYSCON_OSTIMERCLKSEL_SEL_MASK)
/*! @} */

/*! @name CMP0FCLKSEL - CMP0 Function Clock Selection */
/*! @{ */

#define SYSCON_CMP0FCLKSEL_SEL_MASK              (0x7U)
#define SYSCON_CMP0FCLKSEL_SEL_SHIFT             (0U)
/*! SEL - Selects the CMP0 function clock
 *  0b000..No clock
 *  0b001..PLL0 clock
 *  0b010..FRO_HF clock
 *  0b011..FRO_12M clock
 *  0b100..CLKIN clock
 *  0b101..PLL1_clk0 clock
 *  0b110..USB PLL clock
 *  0b111..No clock
 */
#define SYSCON_CMP0FCLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_CMP0FCLKSEL_SEL_SHIFT)) & SYSCON_CMP0FCLKSEL_SEL_MASK)
/*! @} */

/*! @name CMP0FCLKDIV - CMP0 Function Clock Divider */
/*! @{ */

#define SYSCON_CMP0FCLKDIV_DIV_MASK              (0xFU)
#define SYSCON_CMP0FCLKDIV_DIV_SHIFT             (0U)
/*! DIV - Clock divider value */
#define SYSCON_CMP0FCLKDIV_DIV(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_CMP0FCLKDIV_DIV_SHIFT)) & SYSCON_CMP0FCLKDIV_DIV_MASK)

