zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXN/periph/PERI_SYSCON.h
#define SYSCON_CMP0FCLKDIV_RESET_MASK            (0x20000000U)
#define SYSCON_CMP0FCLKDIV_RESET_SHIFT           (29U)
/*! RESET - Resets the divider counter
 *  0b0..Divider is not reset
 *  0b1..Divider is reset
 */
#define SYSCON_CMP0FCLKDIV_RESET(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_CMP0FCLKDIV_RESET_SHIFT)) & SYSCON_CMP0FCLKDIV_RESET_MASK)

#define SYSCON_CMP0FCLKDIV_HALT_MASK             (0x40000000U)
#define SYSCON_CMP0FCLKDIV_HALT_SHIFT            (30U)
/*! HALT - Halts the divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define SYSCON_CMP0FCLKDIV_HALT(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_CMP0FCLKDIV_HALT_SHIFT)) & SYSCON_CMP0FCLKDIV_HALT_MASK)

#define SYSCON_CMP0FCLKDIV_UNSTAB_MASK           (0x80000000U)
#define SYSCON_CMP0FCLKDIV_UNSTAB_SHIFT          (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency is not stable
 */
#define SYSCON_CMP0FCLKDIV_UNSTAB(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_CMP0FCLKDIV_UNSTAB_SHIFT)) & SYSCON_CMP0FCLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name CMP0RRCLKSEL - CMP0 Round Robin Clock Selection */
/*! @{ */

#define SYSCON_CMP0RRCLKSEL_SEL_MASK             (0x7U)
#define SYSCON_CMP0RRCLKSEL_SEL_SHIFT            (0U)
/*! SEL - Selects the CMP0 round robin clock
 *  0b000..No clock
 *  0b001..PLL0 clock
 *  0b010..FRO_HF clock
 *  0b011..FRO_12M clock
 *  0b100..CLKIN clock
 *  0b101..PLL1_clk0 clock
 *  0b110..USB PLL clock
 *  0b111..No clock
 */
#define SYSCON_CMP0RRCLKSEL_SEL(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_CMP0RRCLKSEL_SEL_SHIFT)) & SYSCON_CMP0RRCLKSEL_SEL_MASK)
/*! @} */

/*! @name CMP0RRCLKDIV - CMP0 Round Robin Clock Divider */
/*! @{ */

#define SYSCON_CMP0RRCLKDIV_DIV_MASK             (0xFU)
#define SYSCON_CMP0RRCLKDIV_DIV_SHIFT            (0U)
/*! DIV - Clock divider value */
#define SYSCON_CMP0RRCLKDIV_DIV(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_CMP0RRCLKDIV_DIV_SHIFT)) & SYSCON_CMP0RRCLKDIV_DIV_MASK)

#define SYSCON_CMP0RRCLKDIV_RESET_MASK           (0x20000000U)
#define SYSCON_CMP0RRCLKDIV_RESET_SHIFT          (29U)
/*! RESET - Resets the divider counter
 *  0b0..Divider is not reset
 *  0b1..Divider is reset
 */
#define SYSCON_CMP0RRCLKDIV_RESET(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_CMP0RRCLKDIV_RESET_SHIFT)) & SYSCON_CMP0RRCLKDIV_RESET_MASK)

#define SYSCON_CMP0RRCLKDIV_HALT_MASK            (0x40000000U)
#define SYSCON_CMP0RRCLKDIV_HALT_SHIFT           (30U)
/*! HALT - Halts the divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define SYSCON_CMP0RRCLKDIV_HALT(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_CMP0RRCLKDIV_HALT_SHIFT)) & SYSCON_CMP0RRCLKDIV_HALT_MASK)

#define SYSCON_CMP0RRCLKDIV_UNSTAB_MASK          (0x80000000U)
#define SYSCON_CMP0RRCLKDIV_UNSTAB_SHIFT         (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency is not stable
 */
#define SYSCON_CMP0RRCLKDIV_UNSTAB(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_CMP0RRCLKDIV_UNSTAB_SHIFT)) & SYSCON_CMP0RRCLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name CMP1FCLKSEL - CMP1 Function Clock Selection */
/*! @{ */

#define SYSCON_CMP1FCLKSEL_SEL_MASK              (0x7U)
#define SYSCON_CMP1FCLKSEL_SEL_SHIFT             (0U)
/*! SEL - Selects the CMP1 function clock
 *  0b000..No clock
 *  0b001..PLL0 clock
 *  0b010..FRO_HF clock
 *  0b011..FRO_12M clock
 *  0b100..CLKIN clock
 *  0b101..PLL1_clk0 clock
 *  0b110..USB PLL clock
 *  0b111..No clock
 */
#define SYSCON_CMP1FCLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_CMP1FCLKSEL_SEL_SHIFT)) & SYSCON_CMP1FCLKSEL_SEL_MASK)
/*! @} */

/*! @name CMP1FCLKDIV - CMP1 Function Clock Divider */
/*! @{ */

#define SYSCON_CMP1FCLKDIV_DIV_MASK              (0xFU)
#define SYSCON_CMP1FCLKDIV_DIV_SHIFT             (0U)
/*! DIV - Clock divider value */
#define SYSCON_CMP1FCLKDIV_DIV(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_CMP1FCLKDIV_DIV_SHIFT)) & SYSCON_CMP1FCLKDIV_DIV_MASK)

#define SYSCON_CMP1FCLKDIV_RESET_MASK            (0x20000000U)
#define SYSCON_CMP1FCLKDIV_RESET_SHIFT           (29U)
/*! RESET - Resets the divider counter
 *  0b0..Divider is not reset
 *  0b1..Divider is reset
 */
#define SYSCON_CMP1FCLKDIV_RESET(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_CMP1FCLKDIV_RESET_SHIFT)) & SYSCON_CMP1FCLKDIV_RESET_MASK)

#define SYSCON_CMP1FCLKDIV_HALT_MASK             (0x40000000U)
#define SYSCON_CMP1FCLKDIV_HALT_SHIFT            (30U)
/*! HALT - Halts the divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define SYSCON_CMP1FCLKDIV_HALT(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_CMP1FCLKDIV_HALT_SHIFT)) & SYSCON_CMP1FCLKDIV_HALT_MASK)

#define SYSCON_CMP1FCLKDIV_UNSTAB_MASK           (0x80000000U)
#define SYSCON_CMP1FCLKDIV_UNSTAB_SHIFT          (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency is not stable
 */
#define SYSCON_CMP1FCLKDIV_UNSTAB(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_CMP1FCLKDIV_UNSTAB_SHIFT)) & SYSCON_CMP1FCLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name CMP1RRCLKSEL - CMP1 Round Robin Clock Source Select */
/*! @{ */

#define SYSCON_CMP1RRCLKSEL_SEL_MASK             (0x7U)
#define SYSCON_CMP1RRCLKSEL_SEL_SHIFT            (0U)
/*! SEL - Selects the CMP1 round robin clock
 *  0b000..No clock
 *  0b001..PLL0 clock
 *  0b010..FRO_HF clock
 *  0b011..FRO_12M clock
 *  0b100..CLKIN clock
 *  0b101..PLL1_clk0 clock
 *  0b110..USB PLL clock
 *  0b111..No clock
 */
#define SYSCON_CMP1RRCLKSEL_SEL(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_CMP1RRCLKSEL_SEL_SHIFT)) & SYSCON_CMP1RRCLKSEL_SEL_MASK)
/*! @} */

/*! @name CMP1RRCLKDIV - CMP1 Round Robin Clock Division */
/*! @{ */

#define SYSCON_CMP1RRCLKDIV_DIV_MASK             (0xFU)
#define SYSCON_CMP1RRCLKDIV_DIV_SHIFT            (0U)
/*! DIV - Clock divider value */
#define SYSCON_CMP1RRCLKDIV_DIV(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_CMP1RRCLKDIV_DIV_SHIFT)) & SYSCON_CMP1RRCLKDIV_DIV_MASK)

