zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXN/periph/PERI_SYSCON.h
/*! @name SAI0CLKSEL - SAI0 Function Clock Source Select */
/*! @{ */

#define SYSCON_SAI0CLKSEL_SEL_MASK               (0x7U)
#define SYSCON_SAI0CLKSEL_SEL_SHIFT              (0U)
/*! SEL - Selects the clock source
 *  0b000..No clock
 *  0b001..PLL0 clock
 *  0b010..CLKIN clock
 *  0b011..FRO_HF clock
 *  0b100..PLL1_CLK0 clock
 *  0b101..No clock
 *  0b110..USB PLL clock
 *  0b111..No clock
 */
#define SYSCON_SAI0CLKSEL_SEL(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCON_SAI0CLKSEL_SEL_SHIFT)) & SYSCON_SAI0CLKSEL_SEL_MASK)
/*! @} */

/*! @name SAI1CLKSEL - SAI1 Function Clock Source Select */
/*! @{ */

#define SYSCON_SAI1CLKSEL_SEL_MASK               (0x7U)
#define SYSCON_SAI1CLKSEL_SEL_SHIFT              (0U)
/*! SEL - Selects the clock source
 *  0b000..No clock
 *  0b001..PLL0 clock
 *  0b010..CLKIN clock
 *  0b011..FRO_HF clock
 *  0b100..PLL1_CLK0 clock
 *  0b101..No clock
 *  0b110..USB PLL clock
 *  0b111..No clock
 */
#define SYSCON_SAI1CLKSEL_SEL(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCON_SAI1CLKSEL_SEL_SHIFT)) & SYSCON_SAI1CLKSEL_SEL_MASK)
/*! @} */

/*! @name SAI0CLKDIV - SAI0 Function Clock Division */
/*! @{ */

#define SYSCON_SAI0CLKDIV_DIV_MASK               (0x7U)
#define SYSCON_SAI0CLKDIV_DIV_SHIFT              (0U)
/*! DIV - Clock divider value */
#define SYSCON_SAI0CLKDIV_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCON_SAI0CLKDIV_DIV_SHIFT)) & SYSCON_SAI0CLKDIV_DIV_MASK)

#define SYSCON_SAI0CLKDIV_RESET_MASK             (0x20000000U)
#define SYSCON_SAI0CLKDIV_RESET_SHIFT            (29U)
/*! RESET - Resets the divider counter
 *  0b0..Divider is not reset
 *  0b1..Divider is reset
 */
#define SYSCON_SAI0CLKDIV_RESET(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_SAI0CLKDIV_RESET_SHIFT)) & SYSCON_SAI0CLKDIV_RESET_MASK)

#define SYSCON_SAI0CLKDIV_HALT_MASK              (0x40000000U)
#define SYSCON_SAI0CLKDIV_HALT_SHIFT             (30U)
/*! HALT - Halts the divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define SYSCON_SAI0CLKDIV_HALT(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_SAI0CLKDIV_HALT_SHIFT)) & SYSCON_SAI0CLKDIV_HALT_MASK)

#define SYSCON_SAI0CLKDIV_UNSTAB_MASK            (0x80000000U)
#define SYSCON_SAI0CLKDIV_UNSTAB_SHIFT           (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency is not stable
 */
#define SYSCON_SAI0CLKDIV_UNSTAB(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_SAI0CLKDIV_UNSTAB_SHIFT)) & SYSCON_SAI0CLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name SAI1CLKDIV - SAI1 Function Clock Division */
/*! @{ */

#define SYSCON_SAI1CLKDIV_DIV_MASK               (0x7U)
#define SYSCON_SAI1CLKDIV_DIV_SHIFT              (0U)
/*! DIV - Clock divider value */
#define SYSCON_SAI1CLKDIV_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCON_SAI1CLKDIV_DIV_SHIFT)) & SYSCON_SAI1CLKDIV_DIV_MASK)

#define SYSCON_SAI1CLKDIV_RESET_MASK             (0x20000000U)
#define SYSCON_SAI1CLKDIV_RESET_SHIFT            (29U)
/*! RESET - Resets the divider counter
 *  0b0..Divider is not reset
 *  0b1..Divider is reset
 */
#define SYSCON_SAI1CLKDIV_RESET(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_SAI1CLKDIV_RESET_SHIFT)) & SYSCON_SAI1CLKDIV_RESET_MASK)

#define SYSCON_SAI1CLKDIV_HALT_MASK              (0x40000000U)
#define SYSCON_SAI1CLKDIV_HALT_SHIFT             (30U)
/*! HALT - Halts the divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define SYSCON_SAI1CLKDIV_HALT(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_SAI1CLKDIV_HALT_SHIFT)) & SYSCON_SAI1CLKDIV_HALT_MASK)

#define SYSCON_SAI1CLKDIV_UNSTAB_MASK            (0x80000000U)
#define SYSCON_SAI1CLKDIV_UNSTAB_SHIFT           (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency is not stable
 */
#define SYSCON_SAI1CLKDIV_UNSTAB(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_SAI1CLKDIV_UNSTAB_SHIFT)) & SYSCON_SAI1CLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name EMVSIM0CLKSEL - EMVSIM0 Clock Source Select */
/*! @{ */

#define SYSCON_EMVSIM0CLKSEL_SEL_MASK            (0x7U)
#define SYSCON_EMVSIM0CLKSEL_SEL_SHIFT           (0U)
/*! SEL - Selects the EMVSIM0 function clock source
 *  0b000..No clock
 *  0b001..PLL0 clock
 *  0b010..CLKIN clock
 *  0b011..FRO_HF clock
 *  0b100..FRO_12M clock
 *  0b101..PLL1_clk0 clock0
 *  0b110..No clock
 *  0b111..No clock
 */
#define SYSCON_EMVSIM0CLKSEL_SEL(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_EMVSIM0CLKSEL_SEL_SHIFT)) & SYSCON_EMVSIM0CLKSEL_SEL_MASK)
/*! @} */

/*! @name EMVSIM1CLKSEL - EMVSIM1 Clock Source Select */
/*! @{ */

#define SYSCON_EMVSIM1CLKSEL_SEL_MASK            (0x7U)
#define SYSCON_EMVSIM1CLKSEL_SEL_SHIFT           (0U)
/*! SEL - Selects the EMVSIM1 function clock source
 *  0b000..No clock
 *  0b001..PLL0 clock
 *  0b010..CLKIN clock
 *  0b011..FRO_HF clock
 *  0b100..FRO_12M clock
 *  0b101..PLL1_clk0 clock0
 *  0b110..No clock
 *  0b111..No clock
 */
#define SYSCON_EMVSIM1CLKSEL_SEL(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_EMVSIM1CLKSEL_SEL_SHIFT)) & SYSCON_EMVSIM1CLKSEL_SEL_MASK)
/*! @} */

/*! @name EMVSIM0CLKDIV - EMVSIM0 Function Clock Division */
/*! @{ */

#define SYSCON_EMVSIM0CLKDIV_DIV_MASK            (0x7U)
#define SYSCON_EMVSIM0CLKDIV_DIV_SHIFT           (0U)
/*! DIV - Clock divider value */
#define SYSCON_EMVSIM0CLKDIV_DIV(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_EMVSIM0CLKDIV_DIV_SHIFT)) & SYSCON_EMVSIM0CLKDIV_DIV_MASK)

#define SYSCON_EMVSIM0CLKDIV_RESET_MASK          (0x20000000U)
#define SYSCON_EMVSIM0CLKDIV_RESET_SHIFT         (29U)
/*! RESET - Resets the divider counter
 *  0b0..Divider is not reset
 *  0b1..Divider is reset
 */
#define SYSCON_EMVSIM0CLKDIV_RESET(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_EMVSIM0CLKDIV_RESET_SHIFT)) & SYSCON_EMVSIM0CLKDIV_RESET_MASK)

#define SYSCON_EMVSIM0CLKDIV_HALT_MASK           (0x40000000U)
#define SYSCON_EMVSIM0CLKDIV_HALT_SHIFT          (30U)
/*! HALT - Halts the divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define SYSCON_EMVSIM0CLKDIV_HALT(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_EMVSIM0CLKDIV_HALT_SHIFT)) & SYSCON_EMVSIM0CLKDIV_HALT_MASK)

#define SYSCON_EMVSIM0CLKDIV_UNSTAB_MASK         (0x80000000U)
#define SYSCON_EMVSIM0CLKDIV_UNSTAB_SHIFT        (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency is not stable
 */
#define SYSCON_EMVSIM0CLKDIV_UNSTAB(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_EMVSIM0CLKDIV_UNSTAB_SHIFT)) & SYSCON_EMVSIM0CLKDIV_UNSTAB_MASK)
/*! @} */

