zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXN/periph/PERI_SYSCON.h
#define SYSCON_I3C1FCLKDIV_DIV_MASK              (0xFFU)
#define SYSCON_I3C1FCLKDIV_DIV_SHIFT             (0U)
/*! DIV - Clock divider value */
#define SYSCON_I3C1FCLKDIV_DIV(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_I3C1FCLKDIV_DIV_SHIFT)) & SYSCON_I3C1FCLKDIV_DIV_MASK)

#define SYSCON_I3C1FCLKDIV_RESET_MASK            (0x20000000U)
#define SYSCON_I3C1FCLKDIV_RESET_SHIFT           (29U)
/*! RESET - Resets the divider counter
 *  0b0..Divider is not reset
 *  0b1..Divider is reset
 */
#define SYSCON_I3C1FCLKDIV_RESET(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_I3C1FCLKDIV_RESET_SHIFT)) & SYSCON_I3C1FCLKDIV_RESET_MASK)

#define SYSCON_I3C1FCLKDIV_HALT_MASK             (0x40000000U)
#define SYSCON_I3C1FCLKDIV_HALT_SHIFT            (30U)
/*! HALT - Halts the divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define SYSCON_I3C1FCLKDIV_HALT(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_I3C1FCLKDIV_HALT_SHIFT)) & SYSCON_I3C1FCLKDIV_HALT_MASK)

#define SYSCON_I3C1FCLKDIV_UNSTAB_MASK           (0x80000000U)
#define SYSCON_I3C1FCLKDIV_UNSTAB_SHIFT          (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency is not stable
 */
#define SYSCON_I3C1FCLKDIV_UNSTAB(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_I3C1FCLKDIV_UNSTAB_SHIFT)) & SYSCON_I3C1FCLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name I3C1FCLKSSEL - I3C1 FCLK Slow Selection */
/*! @{ */

#define SYSCON_I3C1FCLKSSEL_SEL_MASK             (0x7U)
#define SYSCON_I3C1FCLKSSEL_SEL_SHIFT            (0U)
/*! SEL - I3C1 FCLK Slow Clock Select
 *  0b000..FRO_1M clock
 *  0b001..No clock
 *  0b010..No clock
 *  0b011..No clock
 *  0b100..No clock
 *  0b101..No clock
 *  0b110..No clock
 *  0b111..No clock
 */
#define SYSCON_I3C1FCLKSSEL_SEL(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_I3C1FCLKSSEL_SEL_SHIFT)) & SYSCON_I3C1FCLKSSEL_SEL_MASK)
/*! @} */

/*! @name ETB_STATUS - ETB Counter Status Register */
/*! @{ */

#define SYSCON_ETB_STATUS_IRQ_MASK               (0x2U)
#define SYSCON_ETB_STATUS_IRQ_SHIFT              (1U)
/*! IRQ - ETB Interrupt
 *  0b0..ETB interrupt is not asserted
 *  0b1..ETB interrupt is asserted when ETB count expires. Write 1 to clear it.
 */
#define SYSCON_ETB_STATUS_IRQ(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCON_ETB_STATUS_IRQ_SHIFT)) & SYSCON_ETB_STATUS_IRQ_MASK)

#define SYSCON_ETB_STATUS_NMI_MASK               (0x4U)
#define SYSCON_ETB_STATUS_NMI_SHIFT              (2U)
/*! NMI - ETB NMI
 *  0b0..ETB NMI is not asserted
 *  0b1..ETB NMI is asserted. Write 1 to clear it.
 */
#define SYSCON_ETB_STATUS_NMI(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCON_ETB_STATUS_NMI_SHIFT)) & SYSCON_ETB_STATUS_NMI_MASK)

#define SYSCON_ETB_STATUS_DBG_HALT_REQ_MASK      (0x8U)
#define SYSCON_ETB_STATUS_DBG_HALT_REQ_SHIFT     (3U)
/*! DBG_HALT_REQ - Debug halt request
 *  0b0..The debug halt request signal is not asserted
 *  0b1..The debug halt request signal is asserted when the ETB count expires
 */
#define SYSCON_ETB_STATUS_DBG_HALT_REQ(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON_ETB_STATUS_DBG_HALT_REQ_SHIFT)) & SYSCON_ETB_STATUS_DBG_HALT_REQ_MASK)
/*! @} */

/*! @name ETB_COUNTER_CTRL - ETB Counter Control Register */
/*! @{ */

#define SYSCON_ETB_COUNTER_CTRL_CNTEN_MASK       (0x1U)
#define SYSCON_ETB_COUNTER_CTRL_CNTEN_SHIFT      (0U)
/*! CNTEN - Enables the ETB counter
 *  0b0..ETB counter is disabled
 *  0b1..ETB counter is enabled
 */
#define SYSCON_ETB_COUNTER_CTRL_CNTEN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_ETB_COUNTER_CTRL_CNTEN_SHIFT)) & SYSCON_ETB_COUNTER_CTRL_CNTEN_MASK)

#define SYSCON_ETB_COUNTER_CTRL_RSPT_MASK        (0x6U)
#define SYSCON_ETB_COUNTER_CTRL_RSPT_SHIFT       (1U)
/*! RSPT - Response Type
 *  0b00..No response when the ETB count expires
 *  0b01..Generates a normal interrupt when the ETB count expires
 *  0b10..Generates an NMI interrupt when the ETB count expires
 *  0b11..Generates a debug halt when the ETB count expires via CPU0 CTICHIN[2]
 */
#define SYSCON_ETB_COUNTER_CTRL_RSPT(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_ETB_COUNTER_CTRL_RSPT_SHIFT)) & SYSCON_ETB_COUNTER_CTRL_RSPT_MASK)

#define SYSCON_ETB_COUNTER_CTRL_RLRQ_MASK        (0x8U)
#define SYSCON_ETB_COUNTER_CTRL_RLRQ_SHIFT       (3U)
/*! RLRQ - Reload request
 *  0b0..No effect
 *  0b1..Clears pending debug halt, NMI, or IRQ interrupt requests
 */
#define SYSCON_ETB_COUNTER_CTRL_RLRQ(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_ETB_COUNTER_CTRL_RLRQ_SHIFT)) & SYSCON_ETB_COUNTER_CTRL_RLRQ_MASK)
/*! @} */

/*! @name ETB_COUNTER_RELOAD - ETB Counter Reload Register */
/*! @{ */

#define SYSCON_ETB_COUNTER_RELOAD_RELOAD_MASK    (0x7FFU)
#define SYSCON_ETB_COUNTER_RELOAD_RELOAD_SHIFT   (0U)
/*! RELOAD - Byte count reload value */
#define SYSCON_ETB_COUNTER_RELOAD_RELOAD(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON_ETB_COUNTER_RELOAD_RELOAD_SHIFT)) & SYSCON_ETB_COUNTER_RELOAD_RELOAD_MASK)
/*! @} */

/*! @name ETB_COUNTER_VALUE - ETB Counter Value Register */
/*! @{ */

#define SYSCON_ETB_COUNTER_VALUE_COUNTER_VALUE_MASK (0x7FFU)
#define SYSCON_ETB_COUNTER_VALUE_COUNTER_VALUE_SHIFT (0U)
/*! COUNTER_VALUE - Byte count counter value */
#define SYSCON_ETB_COUNTER_VALUE_COUNTER_VALUE(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ETB_COUNTER_VALUE_COUNTER_VALUE_SHIFT)) & SYSCON_ETB_COUNTER_VALUE_COUNTER_VALUE_MASK)
/*! @} */

/*! @name GRAY_CODE_LSB - Gray to Binary Converter Gray code_gray[31:0] */
/*! @{ */

#define SYSCON_GRAY_CODE_LSB_code_gray_31_0_MASK (0xFFFFFFFFU)
#define SYSCON_GRAY_CODE_LSB_code_gray_31_0_SHIFT (0U)
/*! code_gray_31_0 - Gray code [31:0] */
#define SYSCON_GRAY_CODE_LSB_code_gray_31_0(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON_GRAY_CODE_LSB_code_gray_31_0_SHIFT)) & SYSCON_GRAY_CODE_LSB_code_gray_31_0_MASK)
/*! @} */

/*! @name GRAY_CODE_MSB - Gray to Binary Converter Gray code_gray[41:32] */
/*! @{ */

#define SYSCON_GRAY_CODE_MSB_code_gray_41_32_MASK (0x3FFU)
#define SYSCON_GRAY_CODE_MSB_code_gray_41_32_SHIFT (0U)
/*! code_gray_41_32 - Gray code [41:32] */
#define SYSCON_GRAY_CODE_MSB_code_gray_41_32(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON_GRAY_CODE_MSB_code_gray_41_32_SHIFT)) & SYSCON_GRAY_CODE_MSB_code_gray_41_32_MASK)
/*! @} */

